; ModuleID = '/home/hiron/linux/fs/namei.c'
source_filename = "/home/hiron/linux/fs/namei.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm ".section \22.export_symbol\22,\22a\22 ; __export_symbol_getname_kernel: ; .asciz \22\22 ; .asciz \22\22 ; .balign 8 ; .quad getname_kernel ; .previous"
module asm ".section \22.export_symbol\22,\22a\22 ; __export_symbol_putname: ; .asciz \22\22 ; .asciz \22\22 ; .balign 8 ; .quad putname ; .previous"
module asm ".section \22.export_symbol\22,\22a\22 ; __export_symbol_generic_permission: ; .asciz \22\22 ; .asciz \22\22 ; .balign 8 ; .quad generic_permission ; .previous"
module asm ".section \22.export_symbol\22,\22a\22 ; __export_symbol_inode_permission: ; .asciz \22\22 ; .asciz \22\22 ; .balign 8 ; .quad inode_permission ; .previous"
module asm ".section \22.export_symbol\22,\22a\22 ; __export_symbol_path_get: ; .asciz \22\22 ; .asciz \22\22 ; .balign 8 ; .quad path_get ; .previous"
module asm ".section \22.export_symbol\22,\22a\22 ; __export_symbol_path_put: ; .asciz \22\22 ; .asciz \22\22 ; .balign 8 ; .quad path_put ; .previous"
module asm ".section\09\22.initcall5.init\22, \22a\22\09\09"
module asm "__initcall__kmod_namei__400_1079_init_fs_namei_sysctls5:\09\09\09"
module asm ".long\09init_fs_namei_sysctls - .\09"
module asm ".previous\09\09\09\09\09"

!31 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dl_dev_state", file: !32, line: 461, baseType: !14, size: 32, elements: !33)
!32 = !DIFile(filename: "linux/include/linux/device.h", directory: "/home/hiron", checksumkind: CSK_MD5, checksum: "adee12e330546c6337cc331212c43d69")
!33 = !{!34, !35, !36, !37}
!34 = !DIEnumerator(name: "DL_DEV_NO_DRIVER", value: 0)
!35 = !DIEnumerator(name: "DL_DEV_PROBING", value: 1)
!36 = !DIEnumerator(name: "DL_DEV_DRIVER_BOUND", value: 2)
!37 = !DIEnumerator(name: "DL_DEV_UNBINDING", value: 3)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "hrtimer_restart", file: !39, line: 65, baseType: !14, size: 32, elements: !40)
!39 = !DIFile(filename: "linux/include/linux/hrtimer.h", directory: "/home/hiron", checksumkind: CSK_MD5, checksum: "01391384e091886095449eb587ff69b6")
!40 = !{!41, !42}
!41 = !DIEnumerator(name: "HRTIMER_NORESTART", value: 0)
!42 = !DIEnumerator(name: "HRTIMER_RESTART", value: 1)
!43 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_request", file: !44, line: 596, baseType: !14, size: 32, elements: !45)
!44 = !DIFile(filename: "linux/include/linux/pm.h", directory: "/home/hiron", checksumkind: CSK_MD5, checksum: "9830713c780704205e9b811e89949281")
!45 = !{!46, !47, !48, !49, !50}
!46 = !DIEnumerator(name: "RPM_REQ_NONE", value: 0)
!47 = !DIEnumerator(name: "RPM_REQ_IDLE", value: 1)
!48 = !DIEnumerator(name: "RPM_REQ_SUSPEND", value: 2)
!49 = !DIEnumerator(name: "RPM_REQ_AUTOSUSPEND", value: 3)
!50 = !DIEnumerator(name: "RPM_REQ_RESUME", value: 4)
!51 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_status", file: !44, line: 573, baseType: !52, size: 32, elements: !53)
!52 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!53 = !{!54, !55, !56, !57, !58}
!54 = !DIEnumerator(name: "RPM_INVALID", value: -1)
!55 = !DIEnumerator(name: "RPM_ACTIVE", value: 0)
!56 = !DIEnumerator(name: "RPM_RESUMING", value: 1)
!57 = !DIEnumerator(name: "RPM_SUSPENDED", value: 2)
!58 = !DIEnumerator(name: "RPM_SUSPENDING", value: 3)
!59 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kobj_ns_type", file: !60, line: 26, baseType: !14, size: 32, elements: !61)
!60 = !DIFile(filename: "linux/include/linux/kobject_ns.h", directory: "/home/hiron", checksumkind: CSK_MD5, checksum: "117a42fea53455e8a509424988d0a1f9")
!61 = !{!62, !63, !64}
!62 = !DIEnumerator(name: "KOBJ_NS_TYPE_NONE", value: 0)
!63 = !DIEnumerator(name: "KOBJ_NS_TYPE_NET", value: 1)
!64 = !DIEnumerator(name: "KOBJ_NS_TYPES", value: 2)
!65 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "device_physical_location_panel", file: !32, line: 521, baseType: !14, size: 32, elements: !66)
!66 = !{!67, !68, !69, !70, !71, !72, !73}
!67 = !DIEnumerator(name: "DEVICE_PANEL_TOP", value: 0)
!68 = !DIEnumerator(name: "DEVICE_PANEL_BOTTOM", value: 1)
!69 = !DIEnumerator(name: "DEVICE_PANEL_LEFT", value: 2)
!70 = !DIEnumerator(name: "DEVICE_PANEL_RIGHT", value: 3)
!71 = !DIEnumerator(name: "DEVICE_PANEL_FRONT", value: 4)
!72 = !DIEnumerator(name: "DEVICE_PANEL_BACK", value: 5)
!73 = !DIEnumerator(name: "DEVICE_PANEL_UNKNOWN", value: 6)
!74 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "device_physical_location_vertical_position", file: !32, line: 538, baseType: !14, size: 32, elements: !75)
!75 = !{!76, !77, !78}
!76 = !DIEnumerator(name: "DEVICE_VERT_POS_UPPER", value: 0)
!77 = !DIEnumerator(name: "DEVICE_VERT_POS_CENTER", value: 1)
!78 = !DIEnumerator(name: "DEVICE_VERT_POS_LOWER", value: 2)
!79 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "device_physical_location_horizontal_position", file: !32, line: 551, baseType: !14, size: 32, elements: !80)
!80 = !{!81, !82, !83}
!81 = !DIEnumerator(name: "DEVICE_HORI_POS_LEFT", value: 0)
!82 = !DIEnumerator(name: "DEVICE_HORI_POS_CENTER", value: 1)
!83 = !DIEnumerator(name: "DEVICE_HORI_POS_RIGHT", value: 2)
!84 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "device_removable", file: !32, line: 477, baseType: !14, size: 32, elements: !85)
!85 = !{!86, !87, !88, !89}
!86 = !DIEnumerator(name: "DEVICE_REMOVABLE_NOT_SUPPORTED", value: 0)
!87 = !DIEnumerator(name: "DEVICE_REMOVABLE_UNKNOWN", value: 1)
!88 = !DIEnumerator(name: "DEVICE_FIXED", value: 2)
!89 = !DIEnumerator(name: "DEVICE_REMOVABLE", value: 3)
!90 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dma_data_direction", file: !91, line: 5, baseType: !14, size: 32, elements: !92)
!91 = !DIFile(filename: "linux/include/linux/dma-direction.h", directory: "/home/hiron", checksumkind: CSK_MD5, checksum: "f3ca6b923deacc70f1b33611ff89af91")
!92 = !{!93, !94, !95, !96}
!93 = !DIEnumerator(name: "DMA_BIDIRECTIONAL", value: 0)
!94 = !DIEnumerator(name: "DMA_TO_DEVICE", value: 1)
!95 = !DIEnumerator(name: "DMA_FROM_DEVICE", value: 2)
!96 = !DIEnumerator(name: "DMA_NONE", value: 3)
!97 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "timespec_type", file: !98, line: 16, baseType: !14, size: 32, elements: !99)
!98 = !DIFile(filename: "linux/include/linux/restart_block.h", directory: "/home/hiron", checksumkind: CSK_MD5, checksum: "79caa3b02853c6620e882f39862ba0c0")
!99 = !{!100, !101, !102}
!100 = !DIEnumerator(name: "TT_NONE", value: 0)
!101 = !DIEnumerator(name: "TT_NATIVE", value: 1)
!102 = !DIEnumerator(name: "TT_COMPAT", value: 2)
!103 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !105, file: !104, line: 147, baseType: !14, size: 32, elements: !194)
!104 = !DIFile(filename: "linux/include/linux/sysctl.h", directory: "/home/hiron", checksumkind: CSK_MD5, checksum: "adcd210bccceaffd519e3bd3b1d1563c")
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ctl_table", file: !104, line: 135, size: 512, elements: !106)
!106 = !{!107, !110, !112, !113, !117, !118, !134, !192, !193}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "procname", scope: !105, file: !104, line: 136, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !105, file: !104, line: 137, baseType: !111, size: 64, offset: 64)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "maxlen", scope: !105, file: !104, line: 138, baseType: !52, size: 32, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !105, file: !104, line: 139, baseType: !114, size: 16, offset: 160)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !115, line: 24, baseType: !116)
!115 = !DIFile(filename: "linux/include/linux/types.h", directory: "/home/hiron", checksumkind: CSK_MD5, checksum: "bdd1b24ee6585d3549e0b4a1be717a98")
!116 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !105, file: !104, line: 150, baseType: !103, size: 32, offset: 192)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "proc_handler", scope: !105, file: !104, line: 151, baseType: !119, size: 64, offset: 256)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "proc_handler", file: !104, line: 64, baseType: !121)
!121 = !DISubroutineType(types: !122)
!122 = !{!52, !123, !52, !111, !124, !130}
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !115, line: 61, baseType: !126)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !127, line: 72, baseType: !128)
!127 = !DIFile(filename: "linux/include/uapi/asm-generic/posix_types.h", directory: "/home/hiron", checksumkind: CSK_MD5, checksum: "02144a993b28778c1e6c05bf0b9f51db")
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !127, line: 16, baseType: !129)
!129 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !115, line: 52, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !127, line: 88, baseType: !133)
!133 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !105, file: !104, line: 152, baseType: !135, size: 64, offset: 320)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ctl_table_poll", file: !104, line: 117, size: 256, elements: !137)
!137 = !{!138, !143}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !136, file: !104, line: 118, baseType: !139, size: 32)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !115, line: 174, baseType: !140)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !115, line: 172, size: 32, elements: !141)
!141 = !{!142}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !140, file: !115, line: 173, baseType: !52, size: 32)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !136, file: !104, line: 119, baseType: !144, size: 192, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "wait_queue_head_t", file: !145, line: 41, baseType: !146)
!145 = !DIFile(filename: "linux/include/linux/wait.h", directory: "/home/hiron", checksumkind: CSK_MD5, checksum: "51f3bca7325aee78271298087883935a")
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wait_queue_head", file: !145, line: 37, size: 192, elements: !147)
!147 = !{!148, !186}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !146, file: !145, line: 38, baseType: !149, size: 32)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !150, line: 29, baseType: !151)
!150 = !DIFile(filename: "linux/include/linux/spinlock_types.h", directory: "/home/hiron", checksumkind: CSK_MD5, checksum: "fc7950471ffdc176b6c133b1f7370f88")
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !150, line: 17, size: 32, elements: !152)
!152 = !{!153}
!153 = !DIDerivedType(tag: DW_TAG_member, scope: !151, file: !150, line: 18, baseType: !154, size: 32)
!154 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !151, file: !150, line: 18, size: 32, elements: !155)
!155 = !{!156}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !154, file: !150, line: 19, baseType: !157, size: 32)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !158, line: 14, size: 32, elements: !159)
!158 = !DIFile(filename: "linux/include/linux/spinlock_types_raw.h", directory: "/home/hiron", checksumkind: CSK_MD5, checksum: "9bbdf30cd339c0a21e6a004bafba78e0")
!159 = !{!160}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !157, file: !158, line: 15, baseType: !161, size: 32)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !162, line: 44, baseType: !163)
!162 = !DIFile(filename: "linux/include/asm-generic/qspinlock_types.h", directory: "/home/hiron", checksumkind: CSK_MD5, checksum: "2a1236eda9a125c2ce03b9a345491b46")
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "qspinlock", file: !162, line: 14, size: 32, elements: !164)
!164 = !{!165}
!165 = !DIDerivedType(tag: DW_TAG_member, scope: !163, file: !162, line: 15, baseType: !166, size: 32)
!166 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !163, file: !162, line: 15, size: 32, elements: !167)
!167 = !{!168, !169, !179}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !166, file: !162, line: 16, baseType: !139, size: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, scope: !166, file: !162, line: 24, baseType: !170, size: 16)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !166, file: !162, line: 24, size: 16, elements: !171)
!171 = !{!172, !178}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "locked", scope: !170, file: !162, line: 25, baseType: !173, size: 8)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !174, line: 17, baseType: !175)
!174 = !DIFile(filename: "linux/include/asm-generic/int-ll64.h", directory: "/home/hiron", checksumkind: CSK_MD5, checksum: "12ca7bdb629352cc4c9a492f86b435a7")
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !176, line: 21, baseType: !177)
!176 = !DIFile(filename: "linux/include/uapi/asm-generic/int-ll64.h", directory: "/home/hiron", checksumkind: CSK_MD5, checksum: "f4d0ec5bcdd84e825a78a7add39d54dd")
!177 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !170, file: !162, line: 26, baseType: !173, size: 8, offset: 8)
!179 = !DIDerivedType(tag: DW_TAG_member, scope: !166, file: !162, line: 28, baseType: !180, size: 32)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !166, file: !162, line: 28, size: 32, elements: !181)
!181 = !{!182, !185}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "locked_pending", scope: !180, file: !162, line: 29, baseType: !183, size: 16)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !174, line: 19, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !176, line: 24, baseType: !116)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !180, file: !162, line: 30, baseType: !183, size: 16, offset: 16)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !146, file: !145, line: 39, baseType: !187, size: 128, offset: 64)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !115, line: 190, size: 128, elements: !188)
!188 = !{!189, !191}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !187, file: !115, line: 191, baseType: !190, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !187, file: !115, line: 191, baseType: !190, size: 64, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "extra1", scope: !105, file: !104, line: 153, baseType: !111, size: 64, offset: 384)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "extra2", scope: !105, file: !104, line: 154, baseType: !111, size: 64, offset: 448)
!194 = !{!195, !196}
!195 = !DIEnumerator(name: "SYSCTL_TABLE_TYPE_DEFAULT", value: 0)
!196 = !DIEnumerator(name: "SYSCTL_TABLE_TYPE_PERMANENTLY_EMPTY", value: 1)
!197 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "fault_flag", file: !198, line: 1192, baseType: !14, size: 32, elements: !199)
!198 = !DIFile(filename: "linux/include/linux/mm_types.h", directory: "/home/hiron", checksumkind: CSK_MD5, checksum: "1b4484a264a3cf6d53406cef05e918ed")
!199 = !{!200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212}
!200 = !DIEnumerator(name: "FAULT_FLAG_WRITE", value: 1)
!201 = !DIEnumerator(name: "FAULT_FLAG_MKWRITE", value: 2)
!202 = !DIEnumerator(name: "FAULT_FLAG_ALLOW_RETRY", value: 4)
!203 = !DIEnumerator(name: "FAULT_FLAG_RETRY_NOWAIT", value: 8)
!204 = !DIEnumerator(name: "FAULT_FLAG_KILLABLE", value: 16)
!205 = !DIEnumerator(name: "FAULT_FLAG_TRIED", value: 32)
!206 = !DIEnumerator(name: "FAULT_FLAG_USER", value: 64)
!207 = !DIEnumerator(name: "FAULT_FLAG_REMOTE", value: 128)
!208 = !DIEnumerator(name: "FAULT_FLAG_INSTRUCTION", value: 256)
!209 = !DIEnumerator(name: "FAULT_FLAG_INTERRUPTIBLE", value: 512)
!210 = !DIEnumerator(name: "FAULT_FLAG_UNSHARE", value: 1024)
!211 = !DIEnumerator(name: "FAULT_FLAG_ORIG_PTE_VALID", value: 2048)
!212 = !DIEnumerator(name: "FAULT_FLAG_VMA_LOCK", value: 4096)
!213 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "page_entry_size", file: !214, line: 536, baseType: !14, size: 32, elements: !215)
!214 = !DIFile(filename: "linux/include/linux/mm.h", directory: "/home/hiron", checksumkind: CSK_MD5, checksum: "aeed4f9a0dd96ea2d58accf052fe27ff")
!215 = !{!216, !217, !218}
!216 = !DIEnumerator(name: "PE_SIZE_PTE", value: 0)
!217 = !DIEnumerator(name: "PE_SIZE_PMD", value: 1)
!218 = !DIEnumerator(name: "PE_SIZE_PUD", value: 2)
!219 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uprobe_task_state", file: !220, line: 51, baseType: !14, size: 32, elements: !221)
!220 = !DIFile(filename: "linux/include/linux/uprobes.h", directory: "/home/hiron", checksumkind: CSK_MD5, checksum: "f1ebe0639d0680c5b5a7b590bb4dc1cf")
!221 = !{!222, !223, !224, !225}
!222 = !DIEnumerator(name: "UTASK_RUNNING", value: 0)
!223 = !DIEnumerator(name: "UTASK_SSTEP", value: 1)
!224 = !DIEnumerator(name: "UTASK_SSTEP_ACK", value: 2)
!225 = !DIEnumerator(name: "UTASK_SSTEP_TRAPPED", value: 3)
!226 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "perf_event_state", file: !227, line: 593, baseType: !52, size: 32, elements: !228)
!227 = !DIFile(filename: "linux/include/linux/perf_event.h", directory: "/home/hiron", checksumkind: CSK_MD5, checksum: "a129daa19fed9983d95de44df7c1ad40")
!228 = !{!229, !230, !231, !232, !233, !234}
!229 = !DIEnumerator(name: "PERF_EVENT_STATE_DEAD", value: -4)
!230 = !DIEnumerator(name: "PERF_EVENT_STATE_EXIT", value: -3)
!231 = !DIEnumerator(name: "PERF_EVENT_STATE_ERROR", value: -2)
!232 = !DIEnumerator(name: "PERF_EVENT_STATE_OFF", value: -1)
!233 = !DIEnumerator(name: "PERF_EVENT_STATE_INACTIVE", value: 0)
!234 = !DIEnumerator(name: "PERF_EVENT_STATE_ACTIVE", value: 1)
!235 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "trace_reg", file: !236, line: 253, baseType: !14, size: 32, elements: !237)
!236 = !DIFile(filename: "linux/include/linux/trace_events.h", directory: "/home/hiron", checksumkind: CSK_MD5, checksum: "174a58d19cad76e80e59cb6491327eb9")
!237 = !{!238, !239, !240, !241, !242, !243, !244, !245}
!238 = !DIEnumerator(name: "TRACE_REG_REGISTER", value: 0)
!239 = !DIEnumerator(name: "TRACE_REG_UNREGISTER", value: 1)
!240 = !DIEnumerator(name: "TRACE_REG_PERF_REGISTER", value: 2)
!241 = !DIEnumerator(name: "TRACE_REG_PERF_UNREGISTER", value: 3)
!242 = !DIEnumerator(name: "TRACE_REG_PERF_OPEN", value: 4)
!243 = !DIEnumerator(name: "TRACE_REG_PERF_CLOSE", value: 5)
!244 = !DIEnumerator(name: "TRACE_REG_PERF_ADD", value: 6)
!245 = !DIEnumerator(name: "TRACE_REG_PERF_DEL", value: 7)
!246 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "print_line_t", file: !236, line: 158, baseType: !14, size: 32, elements: !247)
!247 = !{!248, !249, !250, !251}
!248 = !DIEnumerator(name: "TRACE_TYPE_PARTIAL_LINE", value: 0)
!249 = !DIEnumerator(name: "TRACE_TYPE_HANDLED", value: 1)
!250 = !DIEnumerator(name: "TRACE_TYPE_UNHANDLED", value: 2)
!251 = !DIEnumerator(name: "TRACE_TYPE_NO_CONSUME", value: 3)
!252 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ftrace_ops_cmd", file: !253, line: 281, baseType: !14, size: 32, elements: !254)
!253 = !DIFile(filename: "linux/include/linux/ftrace.h", directory: "/home/hiron", checksumkind: CSK_MD5, checksum: "a129967f0df581ea6099bb0ee6b5529b")
!254 = !{!255, !256, !257}
!255 = !DIEnumerator(name: "FTRACE_OPS_CMD_ENABLE_SHARE_IPMODIFY_SELF", value: 0)
!256 = !DIEnumerator(name: "FTRACE_OPS_CMD_ENABLE_SHARE_IPMODIFY_PEER", value: 1)
!257 = !DIEnumerator(name: "FTRACE_OPS_CMD_DISABLE_SHARE_IPMODIFY_PEER", value: 2)
!258 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pid_type", file: !259, line: 9, baseType: !14, size: 32, elements: !260)
!259 = !DIFile(filename: "linux/include/linux/pid.h", directory: "/home/hiron", checksumkind: CSK_MD5, checksum: "c6c8c3c4044af03e8c0068621cd58605")
!260 = !{!261, !262, !263, !264, !265}
!261 = !DIEnumerator(name: "PIDTYPE_PID", value: 0)
!262 = !DIEnumerator(name: "PIDTYPE_TGID", value: 1)
!263 = !DIEnumerator(name: "PIDTYPE_PGID", value: 2)
!264 = !DIEnumerator(name: "PIDTYPE_SID", value: 3)
!265 = !DIEnumerator(name: "PIDTYPE_MAX", value: 4)
!266 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "memory_type", file: !267, line: 68, baseType: !14, size: 32, elements: !268)
!267 = !DIFile(filename: "linux/include/linux/memremap.h", directory: "/home/hiron", checksumkind: CSK_MD5, checksum: "9fdc8a878c73b8b3e2b17b20cbab6564")
!268 = !{!269, !270, !271, !272, !273}
!269 = !DIEnumerator(name: "MEMORY_DEVICE_PRIVATE", value: 1)
!270 = !DIEnumerator(name: "MEMORY_DEVICE_COHERENT", value: 2)
!271 = !DIEnumerator(name: "MEMORY_DEVICE_FS_DAX", value: 3)
!272 = !DIEnumerator(name: "MEMORY_DEVICE_GENERIC", value: 4)
!273 = !DIEnumerator(name: "MEMORY_DEVICE_PCI_P2PDMA", value: 5)
!274 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "migrate_mode", file: !275, line: 15, baseType: !14, size: 32, elements: !276)
!275 = !DIFile(filename: "linux/include/linux/migrate_mode.h", directory: "/home/hiron", checksumkind: CSK_MD5, checksum: "2b12e7d4ee7cceca905e3df5cef47de9")
!276 = !{!277, !278, !279, !280}
!277 = !DIEnumerator(name: "MIGRATE_ASYNC", value: 0)
!278 = !DIEnumerator(name: "MIGRATE_SYNC_LIGHT", value: 1)
!279 = !DIEnumerator(name: "MIGRATE_SYNC", value: 2)
!280 = !DIEnumerator(name: "MIGRATE_SYNC_NO_COPY", value: 3)
!281 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "class_map_type", file: !282, line: 59, baseType: !14, size: 32, elements: !283)
!282 = !DIFile(filename: "linux/include/linux/dynamic_debug.h", directory: "/home/hiron", checksumkind: CSK_MD5, checksum: "c4304013d54c076c6d943ed73b5d33af")
!283 = !{!284, !285, !286, !287}
!284 = !DIEnumerator(name: "DD_CLASS_TYPE_DISJOINT_BITS", value: 0)
!285 = !DIEnumerator(name: "DD_CLASS_TYPE_LEVEL_NUM", value: 1)
!286 = !DIEnumerator(name: "DD_CLASS_TYPE_DISJOINT_NAMES", value: 2)
!287 = !DIEnumerator(name: "DD_CLASS_TYPE_LEVEL_NAMES", value: 3)
!288 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quota_type", file: !289, line: 54, baseType: !14, size: 32, elements: !290)
!289 = !DIFile(filename: "linux/include/linux/quota.h", directory: "/home/hiron", checksumkind: CSK_MD5, checksum: "8f080db39d58e181bad04637d68ed8d4")
!290 = !{!291, !292, !293}
!291 = !DIEnumerator(name: "USRQUOTA", value: 0)
!292 = !DIEnumerator(name: "GRPQUOTA", value: 1)
!293 = !DIEnumerator(name: "PRJQUOTA", value: 2)
!294 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "inode_i_mutex_lock_class", file: !295, line: 759, baseType: !14, size: 32, elements: !296)
!295 = !DIFile(filename: "linux/include/linux/fs.h", directory: "/home/hiron", checksumkind: CSK_MD5, checksum: "4bc99607c61508470b699d4eb782682d")
!296 = !{!297, !298, !299, !300, !301, !302}
!297 = !DIEnumerator(name: "I_MUTEX_NORMAL", value: 0)
!298 = !DIEnumerator(name: "I_MUTEX_PARENT", value: 1)
!299 = !DIEnumerator(name: "I_MUTEX_CHILD", value: 2)
!300 = !DIEnumerator(name: "I_MUTEX_XATTR", value: 3)
!301 = !DIEnumerator(name: "I_MUTEX_NONDIR2", value: 4)
!302 = !DIEnumerator(name: "I_MUTEX_PARENT2", value: 5)
!303 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !304, line: 18, baseType: !14, size: 32, elements: !305)
!304 = !DIFile(filename: "linux/include/linux/namei.h", directory: "/home/hiron", checksumkind: CSK_MD5, checksum: "661c5a60bb5f888b1125c4324650f35a")
!305 = !{!306, !307, !308, !309}
!306 = !DIEnumerator(name: "LAST_NORM", value: 0)
!307 = !DIEnumerator(name: "LAST_ROOT", value: 1)
!308 = !DIEnumerator(name: "LAST_DOT", value: 2)
!309 = !DIEnumerator(name: "LAST_DOTDOT", value: 3)
!310 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !311, line: 356, baseType: !14, size: 32, elements: !312)
!311 = !DIFile(filename: "linux/include/linux/slab.h", directory: "/home/hiron", checksumkind: CSK_MD5, checksum: "3d48f31ee90b2f0326a951718a31b694")
!312 = !{!313, !314, !315, !316, !317}
!313 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0)
!314 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1)
!315 = !DIEnumerator(name: "KMALLOC_DMA", value: 2)
!316 = !DIEnumerator(name: "KMALLOC_CGROUP", value: 3)
!317 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 4)
!318 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "refcount_saturation_type", file: !319, line: 119, baseType: !14, size: 32, elements: !320)
!319 = !DIFile(filename: "linux/include/linux/refcount.h", directory: "/home/hiron", checksumkind: CSK_MD5, checksum: "e7caf801ca057628e7b6cce80f0a5d10")
!320 = !{!321, !322, !323, !324, !325}
!321 = !DIEnumerator(name: "REFCOUNT_ADD_NOT_ZERO_OVF", value: 0)
!322 = !DIEnumerator(name: "REFCOUNT_ADD_OVF", value: 1)
!323 = !DIEnumerator(name: "REFCOUNT_ADD_UAF", value: 2)
!324 = !DIEnumerator(name: "REFCOUNT_SUB_UAF", value: 3)
!325 = !DIEnumerator(name: "REFCOUNT_DEC_LEAK", value: 4)
!326 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !2, line: 1749, baseType: !14, size: 32, elements: !327)
!327 = !{!328, !329, !330}
!328 = !DIEnumerator(name: "WALK_TRAILING", value: 1)
!329 = !DIEnumerator(name: "WALK_MORE", value: 2)
!330 = !DIEnumerator(name: "WALK_NOFOLLOW", value: 4)
!331 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "fsnotify_data_type", file: !332, line: 286, baseType: !14, size: 32, elements: !333)
!332 = !DIFile(filename: "linux/include/linux/fsnotify_backend.h", directory: "/home/hiron", checksumkind: CSK_MD5, checksum: "843cf0d23de170faef429e4c958dfd75")
!333 = !{!334, !335, !336, !337, !338}
!334 = !DIEnumerator(name: "FSNOTIFY_EVENT_NONE", value: 0)
!335 = !DIEnumerator(name: "FSNOTIFY_EVENT_PATH", value: 1)
!336 = !DIEnumerator(name: "FSNOTIFY_EVENT_INODE", value: 2)
!337 = !DIEnumerator(name: "FSNOTIFY_EVENT_DENTRY", value: 3)
!338 = !DIEnumerator(name: "FSNOTIFY_EVENT_ERROR", value: 4)
!339 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pageflags", file: !340, line: 100, baseType: !14, size: 32, elements: !341)
!340 = !DIFile(filename: "linux/include/linux/page-flags.h", directory: "/home/hiron", checksumkind: CSK_MD5, checksum: "0f65217a2d2d141bea590e8323cff045")
!341 = !{!342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379}
!342 = !DIEnumerator(name: "PG_locked", value: 0)
!343 = !DIEnumerator(name: "PG_referenced", value: 1)
!344 = !DIEnumerator(name: "PG_uptodate", value: 2)
!345 = !DIEnumerator(name: "PG_dirty", value: 3)
!346 = !DIEnumerator(name: "PG_lru", value: 4)
!347 = !DIEnumerator(name: "PG_active", value: 5)
!348 = !DIEnumerator(name: "PG_workingset", value: 6)
!349 = !DIEnumerator(name: "PG_waiters", value: 7)
!350 = !DIEnumerator(name: "PG_error", value: 8)
!351 = !DIEnumerator(name: "PG_slab", value: 9)
!352 = !DIEnumerator(name: "PG_owner_priv_1", value: 10)
!353 = !DIEnumerator(name: "PG_arch_1", value: 11)
!354 = !DIEnumerator(name: "PG_reserved", value: 12)
!355 = !DIEnumerator(name: "PG_private", value: 13)
!356 = !DIEnumerator(name: "PG_private_2", value: 14)
!357 = !DIEnumerator(name: "PG_writeback", value: 15)
!358 = !DIEnumerator(name: "PG_head", value: 16)
!359 = !DIEnumerator(name: "PG_mappedtodisk", value: 17)
!360 = !DIEnumerator(name: "PG_reclaim", value: 18)
!361 = !DIEnumerator(name: "PG_swapbacked", value: 19)
!362 = !DIEnumerator(name: "PG_unevictable", value: 20)
!363 = !DIEnumerator(name: "PG_mlocked", value: 21)
!364 = !DIEnumerator(name: "PG_uncached", value: 22)
!365 = !DIEnumerator(name: "PG_hwpoison", value: 23)
!366 = !DIEnumerator(name: "__NR_PAGEFLAGS", value: 24)
!367 = !DIEnumerator(name: "PG_readahead", value: 18)
!368 = !DIEnumerator(name: "PG_anon_exclusive", value: 17)
!369 = !DIEnumerator(name: "PG_checked", value: 10)
!370 = !DIEnumerator(name: "PG_swapcache", value: 10)
!371 = !DIEnumerator(name: "PG_fscache", value: 14)
!372 = !DIEnumerator(name: "PG_pinned", value: 10)
!373 = !DIEnumerator(name: "PG_savepinned", value: 3)
!374 = !DIEnumerator(name: "PG_foreign", value: 10)
!375 = !DIEnumerator(name: "PG_xen_remapped", value: 10)
!376 = !DIEnumerator(name: "PG_has_hwpoisoned", value: 8)
!377 = !DIEnumerator(name: "PG_isolated", value: 18)
!378 = !DIEnumerator(name: "PG_reported", value: 2)
!379 = !DIEnumerator(name: "PG_vmemmap_self_hosted", value: 10)
!380 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "zone_type", file: !381, line: 716, baseType: !14, size: 32, elements: !382)
!381 = !DIFile(filename: "linux/include/linux/mmzone.h", directory: "/home/hiron", checksumkind: CSK_MD5, checksum: "2b40a560f34dd347f8626cebaa517b24")
!382 = !{!383, !384, !385, !386, !387, !388}
!383 = !DIEnumerator(name: "ZONE_DMA", value: 0)
!384 = !DIEnumerator(name: "ZONE_DMA32", value: 1)
!385 = !DIEnumerator(name: "ZONE_NORMAL", value: 2)
!386 = !DIEnumerator(name: "ZONE_MOVABLE", value: 3)
!387 = !DIEnumerator(name: "ZONE_DEVICE", value: 4)
!388 = !DIEnumerator(name: "__MAX_NR_ZONES", value: 5)
!389 = !{!390, !391, !111, !125, !129, !392, !395, !397, !400, !810, !14, !7675, !1630, !791, !7678, !1077, !412, !419, !5395, !4670, !985, !7679, !850, !1001, !7682, !7685, !52, !108, !114, !7687, !7690, !2749, !7693, !7696, !7697, !7698, !7053, !1863}
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !115, line: 154, baseType: !14)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !174, line: 23, baseType: !393)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !176, line: 31, baseType: !394)
!394 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !174, line: 21, baseType: !396)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !176, line: 27, baseType: !14)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !399)
!399 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !14)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !402)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cred", file: !403, line: 110, size: 1408, elements: !404)
!403 = !DIFile(filename: "linux/include/linux/cred.h", directory: "/home/hiron", checksumkind: CSK_MD5, checksum: "8134f466324390c4d6e0b62053232854")
!404 = !{!405, !406, !414, !421, !422, !423, !424, !425, !426, !427, !428, !434, !435, !436, !437, !438, !439, !596, !597, !598, !599, !600, !637, !794, !795, !805}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !402, file: !403, line: 111, baseType: !139, size: 32)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !402, file: !403, line: 119, baseType: !407, size: 32, offset: 32)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "kuid_t", file: !408, line: 23, baseType: !409)
!408 = !DIFile(filename: "linux/include/linux/uidgid.h", directory: "/home/hiron", checksumkind: CSK_MD5, checksum: "a58253b1216c6e90ad8db58db462410d")
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !408, line: 21, size: 32, elements: !410)
!410 = !{!411}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !409, file: !408, line: 22, baseType: !412, size: 32)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !115, line: 37, baseType: !413)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_uid32_t", file: !127, line: 49, baseType: !14)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !402, file: !403, line: 120, baseType: !415, size: 32, offset: 64)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "kgid_t", file: !408, line: 28, baseType: !416)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !408, line: 26, size: 32, elements: !417)
!417 = !{!418}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !416, file: !408, line: 27, baseType: !419, size: 32)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !115, line: 38, baseType: !420)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_gid32_t", file: !127, line: 50, baseType: !14)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "suid", scope: !402, file: !403, line: 121, baseType: !407, size: 32, offset: 96)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "sgid", scope: !402, file: !403, line: 122, baseType: !415, size: 32, offset: 128)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "euid", scope: !402, file: !403, line: 123, baseType: !407, size: 32, offset: 160)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "egid", scope: !402, file: !403, line: 124, baseType: !415, size: 32, offset: 192)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "fsuid", scope: !402, file: !403, line: 125, baseType: !407, size: 32, offset: 224)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "fsgid", scope: !402, file: !403, line: 126, baseType: !415, size: 32, offset: 256)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "securebits", scope: !402, file: !403, line: 127, baseType: !14, size: 32, offset: 288)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "cap_inheritable", scope: !402, file: !403, line: 128, baseType: !429, size: 64, offset: 320)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "kernel_cap_t", file: !430, line: 24, baseType: !431)
!430 = !DIFile(filename: "linux/include/linux/capability.h", directory: "/home/hiron", checksumkind: CSK_MD5, checksum: "844d16bbc1c5d5ddd3d4dd45f55bc1eb")
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !430, line: 24, size: 64, elements: !432)
!432 = !{!433}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !431, file: !430, line: 24, baseType: !392, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "cap_permitted", scope: !402, file: !403, line: 129, baseType: !429, size: 64, offset: 384)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "cap_effective", scope: !402, file: !403, line: 130, baseType: !429, size: 64, offset: 448)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "cap_bset", scope: !402, file: !403, line: 131, baseType: !429, size: 64, offset: 512)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "cap_ambient", scope: !402, file: !403, line: 132, baseType: !429, size: 64, offset: 576)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "jit_keyring", scope: !402, file: !403, line: 134, baseType: !177, size: 8, offset: 640)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "session_keyring", scope: !402, file: !403, line: 136, baseType: !440, size: 64, offset: 704)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "key", file: !442, line: 195, size: 1728, elements: !443)
!442 = !DIFile(filename: "linux/include/linux/key.h", directory: "/home/hiron", checksumkind: CSK_MD5, checksum: "d53fafbe45ee20e0375ce810c4e5dab2")
!443 = !{!444, !449, !454, !466, !488, !491, !492, !499, !500, !501, !502, !505, !506, !507, !509, !510, !558, !581}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !441, file: !442, line: 196, baseType: !445, size: 32)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !319, line: 113, baseType: !446)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !319, line: 111, size: 32, elements: !447)
!447 = !{!448}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !446, file: !319, line: 112, baseType: !139, size: 32)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !441, file: !442, line: 197, baseType: !450, size: 32, offset: 32)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "key_serial_t", file: !442, line: 28, baseType: !451)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !115, line: 104, baseType: !452)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "s32", file: !174, line: 20, baseType: !453)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !176, line: 26, baseType: !52)
!454 = !DIDerivedType(tag: DW_TAG_member, scope: !441, file: !442, line: 198, baseType: !455, size: 192, offset: 64)
!455 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !441, file: !442, line: 198, size: 192, elements: !456)
!456 = !{!457, !458}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "graveyard_link", scope: !455, file: !442, line: 199, baseType: !187, size: 128)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "serial_node", scope: !455, file: !442, line: 200, baseType: !459, size: 192, align: 64)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !460, line: 5, size: 192, align: 64, elements: !461)
!460 = !DIFile(filename: "linux/include/linux/rbtree_types.h", directory: "/home/hiron", checksumkind: CSK_MD5, checksum: "8417af8a8bff2c6b1a545902a3b285de")
!461 = !{!462, !463, !465}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !459, file: !460, line: 6, baseType: !129, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !459, file: !460, line: 7, baseType: !464, size: 64, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !459, file: !460, line: 8, baseType: !464, size: 64, offset: 128)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !441, file: !442, line: 205, baseType: !467, size: 320, offset: 256)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rw_semaphore", file: !468, line: 48, size: 320, elements: !469)
!468 = !DIFile(filename: "linux/include/linux/rwsem.h", directory: "/home/hiron", checksumkind: CSK_MD5, checksum: "27edc7e0af8a1693f9adbf58deac1a18")
!469 = !{!470, !479, !480, !485, !487}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !467, file: !468, line: 49, baseType: !471, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !472, line: 13, baseType: !473)
!472 = !DIFile(filename: "linux/include/linux/atomic/atomic-long.h", directory: "/home/hiron", checksumkind: CSK_MD5, checksum: "a2e16419cf0734d1c963b754e2487002")
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !115, line: 181, baseType: !474)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !115, line: 179, size: 64, elements: !475)
!475 = !{!476}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !474, file: !115, line: 180, baseType: !477, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !174, line: 22, baseType: !478)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !176, line: 30, baseType: !133)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !467, file: !468, line: 55, baseType: !471, size: 64, offset: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "osq", scope: !467, file: !468, line: 57, baseType: !481, size: 32, offset: 128)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "optimistic_spin_queue", file: !482, line: 15, size: 32, elements: !483)
!482 = !DIFile(filename: "linux/include/linux/osq_lock.h", directory: "/home/hiron", checksumkind: CSK_MD5, checksum: "96068aa09fa474bd706a2c16987ff9d4")
!483 = !{!484}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !481, file: !482, line: 20, baseType: !139, size: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !467, file: !468, line: 59, baseType: !486, size: 32, offset: 160)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !158, line: 23, baseType: !157)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !467, file: !468, line: 60, baseType: !187, size: 128, offset: 192)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !441, file: !442, line: 206, baseType: !489, size: 64, offset: 576)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DICompositeType(tag: DW_TAG_structure_type, name: "key_user", file: !442, line: 206, flags: DIFlagFwdDecl)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "security", scope: !441, file: !442, line: 207, baseType: !111, size: 64, offset: 640)
!492 = !DIDerivedType(tag: DW_TAG_member, scope: !441, file: !442, line: 208, baseType: !493, size: 64, offset: 704)
!493 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !441, file: !442, line: 208, size: 64, elements: !494)
!494 = !{!495, !498}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "expiry", scope: !493, file: !442, line: 209, baseType: !496, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "time64_t", file: !497, line: 8, baseType: !478)
!497 = !DIFile(filename: "linux/include/linux/time64.h", directory: "/home/hiron", checksumkind: CSK_MD5, checksum: "d597827474cd37ab3c64b0e07d237cd6")
!498 = !DIDerivedType(tag: DW_TAG_member, name: "revoked_at", scope: !493, file: !442, line: 210, baseType: !496, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "last_used_at", scope: !441, file: !442, line: 212, baseType: !496, size: 64, offset: 768)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !441, file: !442, line: 213, baseType: !407, size: 32, offset: 832)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !441, file: !442, line: 214, baseType: !415, size: 32, offset: 864)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !441, file: !442, line: 215, baseType: !503, size: 32, offset: 896)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "key_perm_t", file: !442, line: 31, baseType: !504)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !115, line: 110, baseType: !395)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "quotalen", scope: !441, file: !442, line: 216, baseType: !116, size: 16, offset: 928)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "datalen", scope: !441, file: !442, line: 217, baseType: !116, size: 16, offset: 944)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !441, file: !442, line: 221, baseType: !508, size: 16, offset: 960)
!508 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !441, file: !442, line: 228, baseType: !129, size: 64, offset: 1024)
!510 = !DIDerivedType(tag: DW_TAG_member, scope: !441, file: !442, line: 245, baseType: !511, size: 320, offset: 1088)
!511 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !441, file: !442, line: 245, size: 320, elements: !512)
!512 = !{!513, !550}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "index_key", scope: !511, file: !442, line: 246, baseType: !514, size: 320)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "keyring_index_key", file: !442, line: 114, size: 320, elements: !515)
!515 = !{!516, !517, !529, !532, !549}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !514, file: !442, line: 116, baseType: !129, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, scope: !514, file: !442, line: 117, baseType: !518, size: 64, offset: 64)
!518 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !514, file: !442, line: 117, size: 64, elements: !519)
!519 = !{!520, !528}
!520 = !DIDerivedType(tag: DW_TAG_member, scope: !518, file: !442, line: 118, baseType: !521, size: 64)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !518, file: !442, line: 118, size: 64, elements: !522)
!522 = !{!523, !524}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "desc_len", scope: !521, file: !442, line: 120, baseType: !183, size: 16)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !521, file: !442, line: 121, baseType: !525, size: 48, offset: 16)
!525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !526)
!526 = !{!527}
!527 = !DISubrange(count: 6)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !518, file: !442, line: 127, baseType: !129, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !514, file: !442, line: 129, baseType: !530, size: 64, offset: 128)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DICompositeType(tag: DW_TAG_structure_type, name: "key_type", file: !442, line: 102, flags: DIFlagFwdDecl)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "domain_tag", scope: !514, file: !442, line: 130, baseType: !533, size: 64, offset: 192)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "key_tag", file: !442, line: 108, size: 192, elements: !535)
!535 = !{!536, !545, !546}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "rcu", scope: !534, file: !442, line: 109, baseType: !537, size: 128, align: 64)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !115, line: 232, size: 128, align: 64, elements: !538)
!538 = !{!539, !541}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !537, file: !115, line: 233, baseType: !540, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !537, file: !115, line: 234, baseType: !542, size: 64, offset: 64)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DISubroutineType(types: !544)
!544 = !{null, !540}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !534, file: !442, line: 110, baseType: !445, size: 32, offset: 128)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "removed", scope: !534, file: !442, line: 111, baseType: !547, size: 8, offset: 160)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !115, line: 35, baseType: !548)
!548 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !514, file: !442, line: 131, baseType: !108, size: 64, offset: 256)
!550 = !DIDerivedType(tag: DW_TAG_member, scope: !511, file: !442, line: 247, baseType: !551, size: 320)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !511, file: !442, line: 247, size: 320, elements: !552)
!552 = !{!553, !554, !555, !556, !557}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !551, file: !442, line: 248, baseType: !129, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "len_desc", scope: !551, file: !442, line: 249, baseType: !129, size: 64, offset: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !551, file: !442, line: 250, baseType: !530, size: 64, offset: 128)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "domain_tag", scope: !551, file: !442, line: 251, baseType: !533, size: 64, offset: 192)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !551, file: !442, line: 252, baseType: !391, size: 64, offset: 256)
!558 = !DIDerivedType(tag: DW_TAG_member, scope: !441, file: !442, line: 260, baseType: !559, size: 256, offset: 1408)
!559 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !441, file: !442, line: 260, size: 256, elements: !560)
!560 = !{!561, !569}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !559, file: !442, line: 261, baseType: !562, size: 256)
!562 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "key_payload", file: !442, line: 134, size: 256, elements: !563)
!563 = !{!564, !565}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "rcu_data0", scope: !562, file: !442, line: 135, baseType: !111, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !562, file: !442, line: 136, baseType: !566, size: 256)
!566 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 256, elements: !567)
!567 = !{!568}
!568 = !DISubrange(count: 4)
!569 = !DIDerivedType(tag: DW_TAG_member, scope: !559, file: !442, line: 262, baseType: !570, size: 256)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !559, file: !442, line: 262, size: 256, elements: !571)
!571 = !{!572, !573}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "name_link", scope: !570, file: !442, line: 264, baseType: !187, size: 128)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !570, file: !442, line: 265, baseType: !574, size: 128, offset: 128)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "assoc_array", file: !575, line: 22, size: 128, elements: !576)
!575 = !DIFile(filename: "linux/include/linux/assoc_array.h", directory: "/home/hiron", checksumkind: CSK_MD5, checksum: "12a70c11037debe270cf6b506589459e")
!576 = !{!577, !580}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !574, file: !575, line: 23, baseType: !578, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DICompositeType(tag: DW_TAG_structure_type, name: "assoc_array_ptr", file: !575, line: 23, flags: DIFlagFwdDecl)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "nr_leaves_on_tree", scope: !574, file: !575, line: 24, baseType: !129, size: 64, offset: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_link", scope: !441, file: !442, line: 280, baseType: !582, size: 64, offset: 1664)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "key_restriction", file: !442, line: 176, size: 192, elements: !584)
!584 = !{!585, !594, !595}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !583, file: !442, line: 177, baseType: !586, size: 64)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "key_restrict_link_func_t", file: !442, line: 171, baseType: !587)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DISubroutineType(types: !589)
!589 = !{!52, !440, !590, !592, !440}
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !531)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !562)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !583, file: !442, line: 178, baseType: !440, size: 64, offset: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "keytype", scope: !583, file: !442, line: 179, baseType: !530, size: 64, offset: 128)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "process_keyring", scope: !402, file: !403, line: 137, baseType: !440, size: 64, offset: 768)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "thread_keyring", scope: !402, file: !403, line: 138, baseType: !440, size: 64, offset: 832)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "request_key_auth", scope: !402, file: !403, line: 139, baseType: !440, size: 64, offset: 896)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "security", scope: !402, file: !403, line: 142, baseType: !111, size: 64, offset: 960)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !402, file: !403, line: 144, baseType: !601, size: 64, offset: 1024)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "user_struct", file: !603, line: 14, size: 1088, elements: !604)
!603 = !DIFile(filename: "linux/include/linux/sched/user.h", directory: "/home/hiron", checksumkind: CSK_MD5, checksum: "5b9b728b5daa0648e64b85855f2d2d7d")
!604 = !{!605, !606, !615, !616, !617, !624, !625, !626}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !602, file: !603, line: 15, baseType: !445, size: 32)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_watches", scope: !602, file: !603, line: 17, baseType: !607, size: 320, offset: 64)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "percpu_counter", file: !608, line: 22, size: 320, elements: !609)
!608 = !DIFile(filename: "linux/include/linux/percpu_counter.h", directory: "/home/hiron", checksumkind: CSK_MD5, checksum: "bd30afdeb73c1a654ed371bd10641877")
!609 = !{!610, !611, !612, !613}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !607, file: !608, line: 23, baseType: !486, size: 32)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !607, file: !608, line: 24, baseType: !477, size: 64, offset: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !607, file: !608, line: 26, baseType: !187, size: 128, offset: 128)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "counters", scope: !607, file: !608, line: 28, baseType: !614, size: 64, offset: 256)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "unix_inflight", scope: !602, file: !603, line: 19, baseType: !129, size: 64, offset: 384)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "pipe_bufs", scope: !602, file: !603, line: 20, baseType: !471, size: 64, offset: 448)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "uidhash_node", scope: !602, file: !603, line: 23, baseType: !618, size: 128, offset: 512)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !115, line: 198, size: 128, elements: !619)
!619 = !{!620, !622}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !618, file: !115, line: 199, baseType: !621, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !618, file: !115, line: 199, baseType: !623, size: 64, offset: 64)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !602, file: !603, line: 24, baseType: !407, size: 32, offset: 640)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "locked_vm", scope: !602, file: !603, line: 29, baseType: !471, size: 64, offset: 704)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "ratelimit", scope: !602, file: !603, line: 36, baseType: !627, size: 320, offset: 768)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ratelimit_state", file: !628, line: 15, size: 320, elements: !629)
!628 = !DIFile(filename: "linux/include/linux/ratelimit_types.h", directory: "/home/hiron", checksumkind: CSK_MD5, checksum: "8a7f0c4e20ae16dd6d451be3252397df")
!629 = !{!630, !631, !632, !633, !634, !635, !636}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !627, file: !628, line: 16, baseType: !486, size: 32)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "interval", scope: !627, file: !628, line: 18, baseType: !52, size: 32, offset: 32)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "burst", scope: !627, file: !628, line: 19, baseType: !52, size: 32, offset: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "printed", scope: !627, file: !628, line: 20, baseType: !52, size: 32, offset: 96)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "missed", scope: !627, file: !628, line: 21, baseType: !52, size: 32, offset: 128)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !627, file: !628, line: 22, baseType: !129, size: 64, offset: 192)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !627, file: !628, line: 23, baseType: !129, size: 64, offset: 256)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "user_ns", scope: !402, file: !403, line: 145, baseType: !638, size: 64, offset: 1088)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "user_namespace", file: !640, line: 68, size: 4992, elements: !641)
!640 = !DIFile(filename: "linux/include/linux/user_namespace.h", directory: "/home/hiron", checksumkind: CSK_MD5, checksum: "e33da7d7f5807cddffee70ee5683e5f4")
!641 = !{!642, !664, !665, !666, !667, !668, !669, !670, !681, !682, !683, !684, !685, !686, !687, !699, !774, !775, !789, !792}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "uid_map", scope: !639, file: !640, line: 69, baseType: !643, size: 576)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uid_gid_map", file: !640, line: 23, size: 576, elements: !644)
!644 = !{!645, !646}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "nr_extents", scope: !643, file: !640, line: 24, baseType: !395, size: 32)
!646 = !DIDerivedType(tag: DW_TAG_member, scope: !643, file: !640, line: 25, baseType: !647, size: 512, offset: 64)
!647 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !643, file: !640, line: 25, size: 512, elements: !648)
!648 = !{!649, !658}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !647, file: !640, line: 26, baseType: !650, size: 480)
!650 = !DICompositeType(tag: DW_TAG_array_type, baseType: !651, size: 480, elements: !656)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uid_gid_extent", file: !640, line: 17, size: 96, elements: !652)
!652 = !{!653, !654, !655}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !651, file: !640, line: 18, baseType: !395, size: 32)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "lower_first", scope: !651, file: !640, line: 19, baseType: !395, size: 32, offset: 32)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !651, file: !640, line: 20, baseType: !395, size: 32, offset: 64)
!656 = !{!657}
!657 = !DISubrange(count: 5)
!658 = !DIDerivedType(tag: DW_TAG_member, scope: !647, file: !640, line: 27, baseType: !659, size: 128)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !647, file: !640, line: 27, size: 128, elements: !660)
!660 = !{!661, !663}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "forward", scope: !659, file: !640, line: 28, baseType: !662, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "reverse", scope: !659, file: !640, line: 29, baseType: !662, size: 64, offset: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "gid_map", scope: !639, file: !640, line: 70, baseType: !643, size: 576, offset: 576)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "projid_map", scope: !639, file: !640, line: 71, baseType: !643, size: 576, offset: 1152)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !639, file: !640, line: 72, baseType: !638, size: 64, offset: 1728)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !639, file: !640, line: 73, baseType: !52, size: 32, offset: 1792)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !639, file: !640, line: 74, baseType: !407, size: 32, offset: 1824)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !639, file: !640, line: 75, baseType: !415, size: 32, offset: 1856)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !639, file: !640, line: 76, baseType: !671, size: 192, offset: 1920)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ns_common", file: !672, line: 9, size: 192, elements: !673)
!672 = !DIFile(filename: "linux/include/linux/ns_common.h", directory: "/home/hiron", checksumkind: CSK_MD5, checksum: "ee32b998ca2668ab19e0ae22cd52a10b")
!673 = !{!674, !675, !679, !680}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "stashed", scope: !671, file: !672, line: 10, baseType: !471, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !671, file: !672, line: 11, baseType: !676, size: 64, offset: 64)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !678)
!678 = !DICompositeType(tag: DW_TAG_structure_type, name: "proc_ns_operations", file: !672, line: 7, flags: DIFlagFwdDecl)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "inum", scope: !671, file: !672, line: 12, baseType: !14, size: 32, offset: 128)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !671, file: !672, line: 13, baseType: !445, size: 32, offset: 160)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !639, file: !640, line: 77, baseType: !129, size: 64, offset: 2112)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "parent_could_setfcap", scope: !639, file: !640, line: 80, baseType: !547, size: 8, offset: 2176)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "keyring_name_list", scope: !639, file: !640, line: 88, baseType: !187, size: 128, offset: 2240)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "user_keyring_register", scope: !639, file: !640, line: 89, baseType: !440, size: 64, offset: 2368)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "keyring_sem", scope: !639, file: !640, line: 90, baseType: !467, size: 320, offset: 2432)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "persistent_keyring_register", scope: !639, file: !640, line: 95, baseType: !440, size: 64, offset: 2752)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !639, file: !640, line: 97, baseType: !688, size: 256, offset: 2816)
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "work_struct", file: !689, line: 98, size: 256, elements: !690)
!689 = !DIFile(filename: "linux/include/linux/workqueue.h", directory: "/home/hiron", checksumkind: CSK_MD5, checksum: "277571a10722a52b035540b727012e50")
!690 = !{!691, !692, !693}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !688, file: !689, line: 99, baseType: !471, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !688, file: !689, line: 100, baseType: !187, size: 128, offset: 64)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !688, file: !689, line: 101, baseType: !694, size: 64, offset: 192)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "work_func_t", file: !689, line: 21, baseType: !695)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DISubroutineType(types: !697)
!697 = !{null, !698}
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !639, file: !640, line: 99, baseType: !700, size: 768, offset: 3072)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ctl_table_set", file: !104, line: 189, size: 768, elements: !701)
!701 = !{!702, !707}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "is_seen", scope: !700, file: !104, line: 190, baseType: !703, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DISubroutineType(types: !705)
!705 = !{!52, !706}
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !700, file: !104, line: 191, baseType: !708, size: 704, offset: 64)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ctl_dir", file: !104, line: 183, size: 704, elements: !709)
!709 = !{!710, !770}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !708, file: !104, line: 185, baseType: !711, size: 640)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ctl_table_header", file: !104, line: 164, size: 640, elements: !712)
!712 = !{!713, !724, !736, !737, !757, !758, !760, !766}
!713 = !DIDerivedType(tag: DW_TAG_member, scope: !711, file: !104, line: 165, baseType: !714, size: 192)
!714 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !711, file: !104, line: 165, size: 192, elements: !715)
!715 = !{!716, !723}
!716 = !DIDerivedType(tag: DW_TAG_member, scope: !714, file: !104, line: 166, baseType: !717, size: 192)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !714, file: !104, line: 166, size: 192, elements: !718)
!718 = !{!719, !720, !721, !722}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "ctl_table", scope: !717, file: !104, line: 167, baseType: !123, size: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !717, file: !104, line: 168, baseType: !52, size: 32, offset: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !717, file: !104, line: 169, baseType: !52, size: 32, offset: 96)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "nreg", scope: !717, file: !104, line: 170, baseType: !52, size: 32, offset: 128)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "rcu", scope: !714, file: !104, line: 172, baseType: !537, size: 128, align: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "unregistering", scope: !711, file: !104, line: 174, baseType: !725, size: 64, offset: 192)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "completion", file: !727, line: 26, size: 256, elements: !728)
!727 = !DIFile(filename: "linux/include/linux/completion.h", directory: "/home/hiron", checksumkind: CSK_MD5, checksum: "1a591b3cacf1992e38b7e9ed15e1d8c7")
!728 = !{!729, !730}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !726, file: !727, line: 27, baseType: !14, size: 32)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !726, file: !727, line: 28, baseType: !731, size: 192, offset: 64)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "swait_queue_head", file: !732, line: 43, size: 192, elements: !733)
!732 = !DIFile(filename: "linux/include/linux/swait.h", directory: "/home/hiron", checksumkind: CSK_MD5, checksum: "426b09bb279807aa78d8e2ce484d86d2")
!733 = !{!734, !735}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !731, file: !732, line: 44, baseType: !486, size: 32)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "task_list", scope: !731, file: !732, line: 45, baseType: !187, size: 128, offset: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "ctl_table_arg", scope: !711, file: !104, line: 175, baseType: !123, size: 64, offset: 256)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !711, file: !104, line: 176, baseType: !738, size: 64, offset: 320)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ctl_table_root", file: !104, line: 194, size: 960, elements: !740)
!740 = !{!741, !742, !746, !753}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "default_set", scope: !739, file: !104, line: 195, baseType: !700, size: 768)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "lookup", scope: !739, file: !104, line: 196, baseType: !743, size: 64, offset: 768)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DISubroutineType(types: !745)
!745 = !{!706, !738}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "set_ownership", scope: !739, file: !104, line: 197, baseType: !747, size: 64, offset: 832)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DISubroutineType(types: !749)
!749 = !{null, !750, !123, !751, !752}
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "permissions", scope: !739, file: !104, line: 200, baseType: !754, size: 64, offset: 896)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DISubroutineType(types: !756)
!756 = !{!52, !750, !123}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !711, file: !104, line: 177, baseType: !706, size: 64, offset: 384)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !711, file: !104, line: 178, baseType: !759, size: 64, offset: 448)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !711, file: !104, line: 179, baseType: !761, size: 64, offset: 512)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ctl_node", file: !104, line: 157, size: 256, elements: !763)
!763 = !{!764, !765}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !762, file: !104, line: 158, baseType: !459, size: 192, align: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !762, file: !104, line: 159, baseType: !750, size: 64, offset: 192)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "inodes", scope: !711, file: !104, line: 180, baseType: !767, size: 64, offset: 576)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !115, line: 194, size: 64, elements: !768)
!768 = !{!769}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !767, file: !115, line: 195, baseType: !621, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !708, file: !104, line: 186, baseType: !771, size: 64, offset: 640)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !460, line: 12, size: 64, elements: !772)
!772 = !{!773}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !771, file: !460, line: 13, baseType: !464, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "sysctls", scope: !639, file: !640, line: 100, baseType: !750, size: 64, offset: 3840)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "ucounts", scope: !639, file: !640, line: 102, baseType: !776, size: 64, offset: 3904)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ucounts", file: !640, line: 107, size: 1280, elements: !778)
!778 = !{!779, !780, !781, !782, !783, !787}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !777, file: !640, line: 108, baseType: !618, size: 128)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !777, file: !640, line: 109, baseType: !638, size: 64, offset: 128)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !777, file: !640, line: 110, baseType: !407, size: 32, offset: 192)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !777, file: !640, line: 111, baseType: !139, size: 32, offset: 224)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "ucount", scope: !777, file: !640, line: 112, baseType: !784, size: 768, offset: 256)
!784 = !DICompositeType(tag: DW_TAG_array_type, baseType: !471, size: 768, elements: !785)
!785 = !{!786}
!786 = !DISubrange(count: 12)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "rlimit", scope: !777, file: !640, line: 113, baseType: !788, size: 256, offset: 1024)
!788 = !DICompositeType(tag: DW_TAG_array_type, baseType: !471, size: 256, elements: !567)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "ucount_max", scope: !639, file: !640, line: 103, baseType: !790, size: 768, offset: 3968)
!790 = !DICompositeType(tag: DW_TAG_array_type, baseType: !791, size: 768, elements: !785)
!791 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "rlimit_max", scope: !639, file: !640, line: 104, baseType: !793, size: 256, offset: 4736)
!793 = !DICompositeType(tag: DW_TAG_array_type, baseType: !791, size: 256, elements: !567)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "ucounts", scope: !402, file: !403, line: 146, baseType: !776, size: 64, offset: 1152)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "group_info", scope: !402, file: !403, line: 147, baseType: !796, size: 64, offset: 1216)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "group_info", file: !403, line: 25, size: 64, elements: !798)
!798 = !{!799, !800, !801}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !797, file: !403, line: 26, baseType: !139, size: 32)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "ngroups", scope: !797, file: !403, line: 27, baseType: !52, size: 32, offset: 32)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !797, file: !403, line: 28, baseType: !802, offset: 64)
!802 = !DICompositeType(tag: DW_TAG_array_type, baseType: !415, elements: !803)
!803 = !{!804}
!804 = !DISubrange(count: -1)
!805 = !DIDerivedType(tag: DW_TAG_member, scope: !402, file: !403, line: 149, baseType: !806, size: 128, offset: 1280)
!806 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !402, file: !403, line: 149, size: 128, elements: !807)
!807 = !{!808, !809}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "non_rcu", scope: !806, file: !403, line: 150, baseType: !52, size: 32)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "rcu", scope: !806, file: !403, line: 151, baseType: !537, size: 128, align: 64)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !812)
!812 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !813)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dentry", file: !815, line: 82, size: 1536, elements: !816)
!815 = !DIFile(filename: "linux/include/linux/dcache.h", directory: "/home/hiron", checksumkind: CSK_MD5, checksum: "09d5de2dd48dac98a78cfbca1aaf6670")
!816 = !{!817, !818, !828, !836, !837, !852, !7643, !7645, !7658, !7659, !7660, !7661, !7662, !7667, !7668, !7669}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "d_flags", scope: !814, file: !815, line: 84, baseType: !14, size: 32)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "d_seq", scope: !814, file: !815, line: 85, baseType: !819, size: 32, offset: 32)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_spinlock_t", file: !820, line: 275, baseType: !821)
!820 = !DIFile(filename: "linux/include/linux/seqlock.h", directory: "/home/hiron", checksumkind: CSK_MD5, checksum: "18e7029043c652db6e1b09ede08b05de")
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount_spinlock", file: !820, line: 275, size: 32, elements: !822)
!822 = !{!823}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "seqcount", scope: !821, file: !820, line: 275, baseType: !824, size: 32)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !820, line: 69, baseType: !825)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !820, line: 64, size: 32, elements: !826)
!826 = !{!827}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !825, file: !820, line: 65, baseType: !14, size: 32)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "d_hash", scope: !814, file: !815, line: 86, baseType: !829, size: 128, offset: 64)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_bl_node", file: !830, line: 38, size: 128, elements: !831)
!830 = !DIFile(filename: "linux/include/linux/list_bl.h", directory: "/home/hiron", checksumkind: CSK_MD5, checksum: "35bd436f1f6159eef157d09cf839df5b")
!831 = !{!832, !834}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !829, file: !830, line: 39, baseType: !833, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !829, file: !830, line: 39, baseType: !835, size: 64, offset: 64)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "d_parent", scope: !814, file: !815, line: 87, baseType: !813, size: 64, offset: 192)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !814, file: !815, line: 88, baseType: !838, size: 128, offset: 256)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "qstr", file: !815, line: 49, size: 128, elements: !839)
!839 = !{!840, !849}
!840 = !DIDerivedType(tag: DW_TAG_member, scope: !838, file: !815, line: 50, baseType: !841, size: 64)
!841 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !838, file: !815, line: 50, size: 64, elements: !842)
!842 = !{!843, !848}
!843 = !DIDerivedType(tag: DW_TAG_member, scope: !841, file: !815, line: 51, baseType: !844, size: 64)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !841, file: !815, line: 51, size: 64, elements: !845)
!845 = !{!846, !847}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !844, file: !815, line: 52, baseType: !395, size: 32)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !844, file: !815, line: 52, baseType: !395, size: 32, offset: 32)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "hash_len", scope: !841, file: !815, line: 54, baseType: !392, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !838, file: !815, line: 56, baseType: !850, size: 64, offset: 64)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !177)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "d_inode", scope: !814, file: !815, line: 89, baseType: !853, size: 64, offset: 384)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode", file: !295, line: 608, size: 5056, elements: !855)
!855 = !{!856, !857, !858, !859, !860, !861, !880, !881, !7563, !7564, !7565, !7566, !7567, !7573, !7574, !7575, !7576, !7577, !7578, !7579, !7580, !7581, !7582, !7583, !7584, !7585, !7586, !7587, !7588, !7589, !7592, !7593, !7594, !7595, !7596, !7597, !7598, !7603, !7604, !7605, !7606, !7607, !7608, !7609, !7614, !7622, !7623, !7624, !7633, !7634, !7635, !7636, !7639, !7642}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "i_mode", scope: !854, file: !295, line: 609, baseType: !114, size: 16)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "i_opflags", scope: !854, file: !295, line: 610, baseType: !116, size: 16, offset: 16)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "i_uid", scope: !854, file: !295, line: 611, baseType: !407, size: 32, offset: 32)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "i_gid", scope: !854, file: !295, line: 612, baseType: !415, size: 32, offset: 64)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !854, file: !295, line: 613, baseType: !14, size: 32, offset: 96)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "i_acl", scope: !854, file: !295, line: 616, baseType: !862, size: 64, offset: 128)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_acl", file: !864, line: 29, size: 256, elements: !865)
!864 = !DIFile(filename: "linux/include/linux/posix_acl.h", directory: "/home/hiron", checksumkind: CSK_MD5, checksum: "c39037fcfa4b446249952b719291151f")
!865 = !{!866, !867, !868, !869}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "a_refcount", scope: !863, file: !864, line: 30, baseType: !445, size: 32)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "a_rcu", scope: !863, file: !864, line: 31, baseType: !537, size: 128, align: 64, offset: 64)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "a_count", scope: !863, file: !864, line: 32, baseType: !14, size: 32, offset: 192)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "a_entries", scope: !863, file: !864, line: 33, baseType: !870, offset: 224)
!870 = !DICompositeType(tag: DW_TAG_array_type, baseType: !871, elements: !803)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_acl_entry", file: !864, line: 20, size: 64, elements: !872)
!872 = !{!873, !874, !875}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "e_tag", scope: !871, file: !864, line: 21, baseType: !508, size: 16)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "e_perm", scope: !871, file: !864, line: 22, baseType: !116, size: 16, offset: 16)
!875 = !DIDerivedType(tag: DW_TAG_member, scope: !871, file: !864, line: 23, baseType: !876, size: 32, offset: 32)
!876 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !871, file: !864, line: 23, size: 32, elements: !877)
!877 = !{!878, !879}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "e_uid", scope: !876, file: !864, line: 24, baseType: !407, size: 32)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "e_gid", scope: !876, file: !864, line: 25, baseType: !415, size: 32)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "i_default_acl", scope: !854, file: !295, line: 617, baseType: !862, size: 64, offset: 192)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "i_op", scope: !854, file: !295, line: 620, baseType: !882, size: 64, offset: 256)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !884)
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode_operations", file: !295, line: 1826, size: 1536, align: 512, elements: !885)
!885 = !{!886, !890, !903, !909, !913, !917, !921, !925, !929, !933, !937, !938, !944, !948, !7493, !7522, !7526, !7532, !7537, !7541, !7545, !7549, !7553, !7559}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "lookup", scope: !884, file: !295, line: 1827, baseType: !887, size: 64)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = !DISubroutineType(types: !889)
!889 = !{!813, !853, !813, !14}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "get_link", scope: !884, file: !295, line: 1828, baseType: !891, size: 64, offset: 64)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DISubroutineType(types: !893)
!893 = !{!108, !813, !853, !894}
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "delayed_call", file: !896, line: 10, size: 128, elements: !897)
!896 = !DIFile(filename: "linux/include/linux/delayed_call.h", directory: "/home/hiron", checksumkind: CSK_MD5, checksum: "e61eb32de84dec9b8b545d0ea330611b")
!897 = !{!898, !902}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !895, file: !896, line: 11, baseType: !899, size: 64)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = !DISubroutineType(types: !901)
!901 = !{null, !111}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !895, file: !896, line: 12, baseType: !111, size: 64, offset: 64)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "permission", scope: !884, file: !295, line: 1829, baseType: !904, size: 64, offset: 128)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = !DISubroutineType(types: !906)
!906 = !{!52, !907, !853, !52}
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = !DICompositeType(tag: DW_TAG_structure_type, name: "mnt_idmap", file: !430, line: 42, flags: DIFlagFwdDecl)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "get_inode_acl", scope: !884, file: !295, line: 1830, baseType: !910, size: 64, offset: 192)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = !DISubroutineType(types: !912)
!912 = !{!862, !853, !52, !547}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "readlink", scope: !884, file: !295, line: 1832, baseType: !914, size: 64, offset: 256)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DISubroutineType(types: !916)
!916 = !{!52, !813, !391, !52}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !884, file: !295, line: 1834, baseType: !918, size: 64, offset: 320)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DISubroutineType(types: !920)
!920 = !{!52, !907, !853, !813, !114, !547}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !884, file: !295, line: 1836, baseType: !922, size: 64, offset: 384)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DISubroutineType(types: !924)
!924 = !{!52, !813, !853, !813}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "unlink", scope: !884, file: !295, line: 1837, baseType: !926, size: 64, offset: 448)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = !DISubroutineType(types: !928)
!928 = !{!52, !853, !813}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "symlink", scope: !884, file: !295, line: 1838, baseType: !930, size: 64, offset: 512)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DISubroutineType(types: !932)
!932 = !{!52, !907, !853, !813, !108}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "mkdir", scope: !884, file: !295, line: 1840, baseType: !934, size: 64, offset: 576)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = !DISubroutineType(types: !936)
!936 = !{!52, !907, !853, !813, !114}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "rmdir", scope: !884, file: !295, line: 1842, baseType: !926, size: 64, offset: 640)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "mknod", scope: !884, file: !295, line: 1843, baseType: !939, size: 64, offset: 704)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = !DISubroutineType(types: !941)
!941 = !{!52, !907, !853, !813, !114, !942}
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !115, line: 21, baseType: !943)
!943 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_dev_t", file: !115, line: 18, baseType: !395)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "rename", scope: !884, file: !295, line: 1845, baseType: !945, size: 64, offset: 768)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = !DISubroutineType(types: !947)
!947 = !{!52, !907, !853, !813, !853, !813, !14}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "setattr", scope: !884, file: !295, line: 1847, baseType: !949, size: 64, offset: 832)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = !DISubroutineType(types: !951)
!951 = !{!52, !907, !813, !952}
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iattr", file: !295, line: 226, size: 640, elements: !954)
!954 = !{!955, !956, !957, !967, !976, !977, !982, !983, !984}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "ia_valid", scope: !953, file: !295, line: 227, baseType: !14, size: 32)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "ia_mode", scope: !953, file: !295, line: 228, baseType: !114, size: 16, offset: 32)
!957 = !DIDerivedType(tag: DW_TAG_member, scope: !953, file: !295, line: 241, baseType: !958, size: 32, offset: 64)
!958 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !953, file: !295, line: 241, size: 32, elements: !959)
!959 = !{!960, !961}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "ia_uid", scope: !958, file: !295, line: 242, baseType: !407, size: 32)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "ia_vfsuid", scope: !958, file: !295, line: 243, baseType: !962, size: 32)
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "vfsuid_t", file: !963, line: 16, baseType: !964)
!963 = !DIFile(filename: "linux/include/linux/mnt_idmapping.h", directory: "/home/hiron", checksumkind: CSK_MD5, checksum: "41af6e4101191153091207971e03c703")
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !963, line: 14, size: 32, elements: !965)
!965 = !{!966}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !964, file: !963, line: 15, baseType: !412, size: 32)
!967 = !DIDerivedType(tag: DW_TAG_member, scope: !953, file: !295, line: 245, baseType: !968, size: 32, offset: 96)
!968 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !953, file: !295, line: 245, size: 32, elements: !969)
!969 = !{!970, !971}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "ia_gid", scope: !968, file: !295, line: 246, baseType: !415, size: 32)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "ia_vfsgid", scope: !968, file: !295, line: 247, baseType: !972, size: 32)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "vfsgid_t", file: !963, line: 20, baseType: !973)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !963, line: 18, size: 32, elements: !974)
!974 = !{!975}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !973, file: !963, line: 19, baseType: !419, size: 32)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "ia_size", scope: !953, file: !295, line: 249, baseType: !131, size: 64, offset: 128)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "ia_atime", scope: !953, file: !295, line: 250, baseType: !978, size: 128, offset: 192)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec64", file: !497, line: 13, size: 128, elements: !979)
!979 = !{!980, !981}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !978, file: !497, line: 14, baseType: !496, size: 64)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !978, file: !497, line: 15, baseType: !791, size: 64, offset: 64)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "ia_mtime", scope: !953, file: !295, line: 251, baseType: !978, size: 128, offset: 320)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "ia_ctime", scope: !953, file: !295, line: 252, baseType: !978, size: 128, offset: 448)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "ia_file", scope: !953, file: !295, line: 259, baseType: !985, size: 64, offset: 576)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !295, line: 961, size: 1856, align: 64, elements: !987)
!987 = !{!988, !999, !1000, !1002, !1003, !1011, !1012, !1013, !7264, !7265, !7266, !7267, !7268, !7486, !7487, !7488, !7489, !7490, !7491, !7492}
!988 = !DIDerivedType(tag: DW_TAG_member, scope: !986, file: !295, line: 962, baseType: !989, size: 128)
!989 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !986, file: !295, line: 962, size: 128, elements: !990)
!990 = !{!991, !997, !998}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "f_llist", scope: !989, file: !295, line: 963, baseType: !992, size: 64)
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "llist_node", file: !993, line: 60, size: 64, elements: !994)
!993 = !DIFile(filename: "linux/include/linux/llist.h", directory: "/home/hiron", checksumkind: CSK_MD5, checksum: "df24efabc3e6763dee25a8dee74e3a37")
!994 = !{!995}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !992, file: !993, line: 61, baseType: !996, size: 64)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "f_rcuhead", scope: !989, file: !295, line: 964, baseType: !537, size: 128, align: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "f_iocb_flags", scope: !989, file: !295, line: 965, baseType: !14, size: 32)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "f_lock", scope: !986, file: !295, line: 972, baseType: !149, size: 32, offset: 128)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "f_mode", scope: !986, file: !295, line: 973, baseType: !1001, size: 32, offset: 160)
!1001 = !DIDerivedType(tag: DW_TAG_typedef, name: "fmode_t", file: !115, line: 156, baseType: !14)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "f_count", scope: !986, file: !295, line: 974, baseType: !471, size: 64, offset: 192)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "f_pos_lock", scope: !986, file: !295, line: 975, baseType: !1004, size: 256, offset: 256)
!1004 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !1005, line: 64, size: 256, elements: !1006)
!1005 = !DIFile(filename: "linux/include/linux/mutex.h", directory: "/home/hiron", checksumkind: CSK_MD5, checksum: "07dbf2af2b9fefa5fbfe27d0e0b15981")
!1006 = !{!1007, !1008, !1009, !1010}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !1004, file: !1005, line: 65, baseType: !471, size: 64)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !1004, file: !1005, line: 66, baseType: !486, size: 32, offset: 64)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "osq", scope: !1004, file: !1005, line: 68, baseType: !481, size: 32, offset: 96)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !1004, file: !1005, line: 70, baseType: !187, size: 128, offset: 128)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "f_pos", scope: !986, file: !295, line: 976, baseType: !131, size: 64, offset: 512)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "f_flags", scope: !986, file: !295, line: 977, baseType: !14, size: 32, offset: 576)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "f_owner", scope: !986, file: !295, line: 978, baseType: !1014, size: 256, offset: 640)
!1014 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fown_struct", file: !295, line: 915, size: 256, elements: !1015)
!1015 = !{!1016, !1039, !7260, !7261, !7262, !7263}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !1014, file: !295, line: 916, baseType: !1017, size: 64)
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "rwlock_t", file: !1018, line: 34, baseType: !1019)
!1018 = !DIFile(filename: "linux/include/linux/rwlock_types.h", directory: "/home/hiron", checksumkind: CSK_MD5, checksum: "dff80c89ec6551b7d56ae9ff5387a240")
!1019 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1018, line: 25, size: 64, elements: !1020)
!1020 = !{!1021}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !1019, file: !1018, line: 26, baseType: !1022, size: 64)
!1022 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_rwlock_t", file: !1023, line: 27, baseType: !1024)
!1023 = !DIFile(filename: "linux/include/asm-generic/qrwlock_types.h", directory: "/home/hiron", checksumkind: CSK_MD5, checksum: "724e2bc1afabb3b7b6860c9799b9cd27")
!1024 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "qrwlock", file: !1023, line: 13, size: 64, elements: !1025)
!1025 = !{!1026, !1038}
!1026 = !DIDerivedType(tag: DW_TAG_member, scope: !1024, file: !1023, line: 14, baseType: !1027, size: 32)
!1027 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1024, file: !1023, line: 14, size: 32, elements: !1028)
!1028 = !{!1029, !1030}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "cnts", scope: !1027, file: !1023, line: 15, baseType: !139, size: 32)
!1030 = !DIDerivedType(tag: DW_TAG_member, scope: !1027, file: !1023, line: 16, baseType: !1031, size: 32)
!1031 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1027, file: !1023, line: 16, size: 32, elements: !1032)
!1032 = !{!1033, !1034}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "wlocked", scope: !1031, file: !1023, line: 18, baseType: !173, size: 8)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "__lstate", scope: !1031, file: !1023, line: 19, baseType: !1035, size: 24, offset: 8)
!1035 = !DICompositeType(tag: DW_TAG_array_type, baseType: !173, size: 24, elements: !1036)
!1036 = !{!1037}
!1037 = !DISubrange(count: 3)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !1024, file: !1023, line: 26, baseType: !161, size: 32, offset: 32)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !1014, file: !295, line: 917, baseType: !1040, size: 64, offset: 64)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64)
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pid", file: !259, line: 59, size: 768, elements: !1042)
!1042 = !{!1043, !1044, !1045, !1046, !1048, !1049, !1050, !1051}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1041, file: !259, line: 61, baseType: !445, size: 32)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1041, file: !259, line: 62, baseType: !14, size: 32, offset: 32)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !1041, file: !259, line: 63, baseType: !149, size: 32, offset: 64)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !1041, file: !259, line: 65, baseType: !1047, size: 256, offset: 128)
!1047 = !DICompositeType(tag: DW_TAG_array_type, baseType: !767, size: 256, elements: !567)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "inodes", scope: !1041, file: !259, line: 66, baseType: !767, size: 64, offset: 384)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "wait_pidfd", scope: !1041, file: !259, line: 68, baseType: !144, size: 192, offset: 448)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "rcu", scope: !1041, file: !259, line: 69, baseType: !537, size: 128, align: 64, offset: 640)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "numbers", scope: !1041, file: !259, line: 70, baseType: !1052, offset: 768)
!1052 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1053, elements: !803)
!1053 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "upid", file: !259, line: 54, size: 128, elements: !1054)
!1054 = !{!1055, !1056}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !1053, file: !259, line: 55, baseType: !52, size: 32)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !1053, file: !259, line: 56, baseType: !1057, size: 64, offset: 64)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64)
!1058 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pid_namespace", file: !1059, line: 34, size: 1152, elements: !1060)
!1059 = !DIFile(filename: "linux/include/linux/pid_namespace.h", directory: "/home/hiron", checksumkind: CSK_MD5, checksum: "c91340d54439aba51ff14022bf640451")
!1060 = !{!1061, !1074, !1075, !1076, !7239, !7240, !7241, !7242, !7255, !7256, !7257, !7258, !7259}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "idr", scope: !1058, file: !1059, line: 35, baseType: !1062, size: 192)
!1062 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "idr", file: !1063, line: 19, size: 192, elements: !1064)
!1063 = !DIFile(filename: "linux/include/linux/idr.h", directory: "/home/hiron", checksumkind: CSK_MD5, checksum: "ff4c632cc7faaf919730860cb6d8c683")
!1064 = !{!1065, !1072, !1073}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "idr_rt", scope: !1062, file: !1063, line: 20, baseType: !1066, size: 128)
!1066 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xarray", file: !1067, line: 296, size: 128, elements: !1068)
!1067 = !DIFile(filename: "linux/include/linux/xarray.h", directory: "/home/hiron", checksumkind: CSK_MD5, checksum: "50df7100d700fe71f35339b514567771")
!1068 = !{!1069, !1070, !1071}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "xa_lock", scope: !1066, file: !1067, line: 297, baseType: !149, size: 32)
