; ModuleID = '/home/hiron/Documents/kernel/linux/fs/namei.c'
source_filename = "/home/hiron/Documents/kernel/linux/fs/namei.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm ".section \22.export_symbol\22,\22a\22 ; __export_symbol_getname_kernel: ; .asciz \22\22 ; .asciz \22\22 ; .balign 8 ; .quad getname_kernel ; .previous"
module asm ".section \22.export_symbol\22,\22a\22 ; __export_symbol_putname: ; .asciz \22\22 ; .asciz \22\22 ; .balign 8 ; .quad putname ; .previous"
module asm ".section \22.export_symbol\22,\22a\22 ; __export_symbol_generic_permission: ; .asciz \22\22 ; .asciz \22\22 ; .balign 8 ; .quad generic_permission ; .previous"
module asm ".section \22.export_symbol\22,\22a\22 ; __export_symbol_inode_permission: ; .asciz \22\22 ; .asciz \22\22 ; .balign 8 ; .quad inode_permission ; .previous"
module asm ".section \22.export_symbol\22,\22a\22 ; __export_symbol_path_get: ; .asciz \22\22 ; .asciz \22\22 ; .balign 8 ; .quad path_get ; .previous"
module asm ".section \22.export_symbol\22,\22a\22 ; __export_symbol_path_put: ; .asciz \22\22 ; .asciz \22\22 ; .balign 8 ; .quad path_put ; .previous"
module asm ".section\09\22.initcall5.init\22, \22a\22\09\09"
module asm "__initcall__kmod_namei__402_1079_init_fs_namei_sysctls5:\09\09\09"
module asm ".long\09init_fs_namei_sysctls - .\09"
module asm ".previous\09\09\09\09\09"

!32 = !DIFile(filename: "kernel/linux/include/linux/device.h", directory: "/home/hiron/Documents", checksumkind: CSK_MD5, checksum: "adee12e330546c6337cc331212c43d69")
!33 = !{!34, !35, !36, !37}
!34 = !DIEnumerator(name: "DL_DEV_NO_DRIVER", value: 0)
!35 = !DIEnumerator(name: "DL_DEV_PROBING", value: 1)
!36 = !DIEnumerator(name: "DL_DEV_DRIVER_BOUND", value: 2)
!37 = !DIEnumerator(name: "DL_DEV_UNBINDING", value: 3)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "hrtimer_restart", file: !39, line: 65, baseType: !14, size: 32, elements: !40)
!39 = !DIFile(filename: "kernel/linux/include/linux/hrtimer.h", directory: "/home/hiron/Documents", checksumkind: CSK_MD5, checksum: "01391384e091886095449eb587ff69b6")
!40 = !{!41, !42}
!41 = !DIEnumerator(name: "HRTIMER_NORESTART", value: 0)
!42 = !DIEnumerator(name: "HRTIMER_RESTART", value: 1)
!43 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_request", file: !44, line: 596, baseType: !14, size: 32, elements: !45)
!44 = !DIFile(filename: "kernel/linux/include/linux/pm.h", directory: "/home/hiron/Documents", checksumkind: CSK_MD5, checksum: "9830713c780704205e9b811e89949281")
!45 = !{!46, !47, !48, !49, !50}
!46 = !DIEnumerator(name: "RPM_REQ_NONE", value: 0)
!47 = !DIEnumerator(name: "RPM_REQ_IDLE", value: 1)
!48 = !DIEnumerator(name: "RPM_REQ_SUSPEND", value: 2)
!49 = !DIEnumerator(name: "RPM_REQ_AUTOSUSPEND", value: 3)
!50 = !DIEnumerator(name: "RPM_REQ_RESUME", value: 4)
!51 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_status", file: !44, line: 573, baseType: !52, size: 32, elements: !53)
!52 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!53 = !{!54, !55, !56, !57, !58}
!54 = !DIEnumerator(name: "RPM_INVALID", value: -1)
!55 = !DIEnumerator(name: "RPM_ACTIVE", value: 0)
!56 = !DIEnumerator(name: "RPM_RESUMING", value: 1)
!57 = !DIEnumerator(name: "RPM_SUSPENDED", value: 2)
!58 = !DIEnumerator(name: "RPM_SUSPENDING", value: 3)
!59 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kobj_ns_type", file: !60, line: 26, baseType: !14, size: 32, elements: !61)
!60 = !DIFile(filename: "kernel/linux/include/linux/kobject_ns.h", directory: "/home/hiron/Documents", checksumkind: CSK_MD5, checksum: "117a42fea53455e8a509424988d0a1f9")
!61 = !{!62, !63, !64}
!62 = !DIEnumerator(name: "KOBJ_NS_TYPE_NONE", value: 0)
!63 = !DIEnumerator(name: "KOBJ_NS_TYPE_NET", value: 1)
!64 = !DIEnumerator(name: "KOBJ_NS_TYPES", value: 2)
!65 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "device_physical_location_panel", file: !32, line: 521, baseType: !14, size: 32, elements: !66)
!66 = !{!67, !68, !69, !70, !71, !72, !73}
!67 = !DIEnumerator(name: "DEVICE_PANEL_TOP", value: 0)
!68 = !DIEnumerator(name: "DEVICE_PANEL_BOTTOM", value: 1)
!69 = !DIEnumerator(name: "DEVICE_PANEL_LEFT", value: 2)
!70 = !DIEnumerator(name: "DEVICE_PANEL_RIGHT", value: 3)
!71 = !DIEnumerator(name: "DEVICE_PANEL_FRONT", value: 4)
!72 = !DIEnumerator(name: "DEVICE_PANEL_BACK", value: 5)
!73 = !DIEnumerator(name: "DEVICE_PANEL_UNKNOWN", value: 6)
!74 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "device_physical_location_vertical_position", file: !32, line: 538, baseType: !14, size: 32, elements: !75)
!75 = !{!76, !77, !78}
!76 = !DIEnumerator(name: "DEVICE_VERT_POS_UPPER", value: 0)
!77 = !DIEnumerator(name: "DEVICE_VERT_POS_CENTER", value: 1)
!78 = !DIEnumerator(name: "DEVICE_VERT_POS_LOWER", value: 2)
!79 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "device_physical_location_horizontal_position", file: !32, line: 551, baseType: !14, size: 32, elements: !80)
!80 = !{!81, !82, !83}
!81 = !DIEnumerator(name: "DEVICE_HORI_POS_LEFT", value: 0)
!82 = !DIEnumerator(name: "DEVICE_HORI_POS_CENTER", value: 1)
!83 = !DIEnumerator(name: "DEVICE_HORI_POS_RIGHT", value: 2)
!84 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "device_removable", file: !32, line: 477, baseType: !14, size: 32, elements: !85)
!85 = !{!86, !87, !88, !89}
!86 = !DIEnumerator(name: "DEVICE_REMOVABLE_NOT_SUPPORTED", value: 0)
!87 = !DIEnumerator(name: "DEVICE_REMOVABLE_UNKNOWN", value: 1)
!88 = !DIEnumerator(name: "DEVICE_FIXED", value: 2)
!89 = !DIEnumerator(name: "DEVICE_REMOVABLE", value: 3)
!90 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dma_data_direction", file: !91, line: 5, baseType: !14, size: 32, elements: !92)
!91 = !DIFile(filename: "kernel/linux/include/linux/dma-direction.h", directory: "/home/hiron/Documents", checksumkind: CSK_MD5, checksum: "f3ca6b923deacc70f1b33611ff89af91")
!92 = !{!93, !94, !95, !96}
!93 = !DIEnumerator(name: "DMA_BIDIRECTIONAL", value: 0)
!94 = !DIEnumerator(name: "DMA_TO_DEVICE", value: 1)
!95 = !DIEnumerator(name: "DMA_FROM_DEVICE", value: 2)
!96 = !DIEnumerator(name: "DMA_NONE", value: 3)
!97 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "timespec_type", file: !98, line: 16, baseType: !14, size: 32, elements: !99)
!98 = !DIFile(filename: "kernel/linux/include/linux/restart_block.h", directory: "/home/hiron/Documents", checksumkind: CSK_MD5, checksum: "79caa3b02853c6620e882f39862ba0c0")
!99 = !{!100, !101, !102}
!100 = !DIEnumerator(name: "TT_NONE", value: 0)
!101 = !DIEnumerator(name: "TT_NATIVE", value: 1)
!102 = !DIEnumerator(name: "TT_COMPAT", value: 2)
!103 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !105, file: !104, line: 147, baseType: !14, size: 32, elements: !194)
!104 = !DIFile(filename: "kernel/linux/include/linux/sysctl.h", directory: "/home/hiron/Documents", checksumkind: CSK_MD5, checksum: "adcd210bccceaffd519e3bd3b1d1563c")
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ctl_table", file: !104, line: 135, size: 512, elements: !106)
!106 = !{!107, !110, !112, !113, !117, !118, !134, !192, !193}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "procname", scope: !105, file: !104, line: 136, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !105, file: !104, line: 137, baseType: !111, size: 64, offset: 64)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "maxlen", scope: !105, file: !104, line: 138, baseType: !52, size: 32, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !105, file: !104, line: 139, baseType: !114, size: 16, offset: 160)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !115, line: 24, baseType: !116)
!115 = !DIFile(filename: "kernel/linux/include/linux/types.h", directory: "/home/hiron/Documents", checksumkind: CSK_MD5, checksum: "bdd1b24ee6585d3549e0b4a1be717a98")
!116 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !105, file: !104, line: 150, baseType: !103, size: 32, offset: 192)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "proc_handler", scope: !105, file: !104, line: 151, baseType: !119, size: 64, offset: 256)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "proc_handler", file: !104, line: 64, baseType: !121)
!121 = !DISubroutineType(types: !122)
!122 = !{!52, !123, !52, !111, !124, !130}
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !115, line: 61, baseType: !126)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !127, line: 72, baseType: !128)
!127 = !DIFile(filename: "kernel/linux/include/uapi/asm-generic/posix_types.h", directory: "/home/hiron/Documents", checksumkind: CSK_MD5, checksum: "02144a993b28778c1e6c05bf0b9f51db")
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !127, line: 16, baseType: !129)
!129 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !115, line: 52, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !127, line: 88, baseType: !133)
!133 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !105, file: !104, line: 152, baseType: !135, size: 64, offset: 320)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ctl_table_poll", file: !104, line: 117, size: 256, elements: !137)
!137 = !{!138, !143}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !136, file: !104, line: 118, baseType: !139, size: 32)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !115, line: 174, baseType: !140)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !115, line: 172, size: 32, elements: !141)
!141 = !{!142}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !140, file: !115, line: 173, baseType: !52, size: 32)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !136, file: !104, line: 119, baseType: !144, size: 192, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "wait_queue_head_t", file: !145, line: 41, baseType: !146)
!145 = !DIFile(filename: "kernel/linux/include/linux/wait.h", directory: "/home/hiron/Documents", checksumkind: CSK_MD5, checksum: "51f3bca7325aee78271298087883935a")
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wait_queue_head", file: !145, line: 37, size: 192, elements: !147)
!147 = !{!148, !186}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !146, file: !145, line: 38, baseType: !149, size: 32)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !150, line: 29, baseType: !151)
!150 = !DIFile(filename: "kernel/linux/include/linux/spinlock_types.h", directory: "/home/hiron/Documents", checksumkind: CSK_MD5, checksum: "fc7950471ffdc176b6c133b1f7370f88")
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !150, line: 17, size: 32, elements: !152)
!152 = !{!153}
!153 = !DIDerivedType(tag: DW_TAG_member, scope: !151, file: !150, line: 18, baseType: !154, size: 32)
!154 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !151, file: !150, line: 18, size: 32, elements: !155)
!155 = !{!156}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !154, file: !150, line: 19, baseType: !157, size: 32)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !158, line: 14, size: 32, elements: !159)
!158 = !DIFile(filename: "kernel/linux/include/linux/spinlock_types_raw.h", directory: "/home/hiron/Documents", checksumkind: CSK_MD5, checksum: "9bbdf30cd339c0a21e6a004bafba78e0")
!159 = !{!160}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !157, file: !158, line: 15, baseType: !161, size: 32)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !162, line: 44, baseType: !163)
!162 = !DIFile(filename: "kernel/linux/include/asm-generic/qspinlock_types.h", directory: "/home/hiron/Documents", checksumkind: CSK_MD5, checksum: "2a1236eda9a125c2ce03b9a345491b46")
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "qspinlock", file: !162, line: 14, size: 32, elements: !164)
!164 = !{!165}
!165 = !DIDerivedType(tag: DW_TAG_member, scope: !163, file: !162, line: 15, baseType: !166, size: 32)
!166 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !163, file: !162, line: 15, size: 32, elements: !167)
!167 = !{!168, !169, !179}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !166, file: !162, line: 16, baseType: !139, size: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, scope: !166, file: !162, line: 24, baseType: !170, size: 16)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !166, file: !162, line: 24, size: 16, elements: !171)
!171 = !{!172, !178}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "locked", scope: !170, file: !162, line: 25, baseType: !173, size: 8)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !174, line: 17, baseType: !175)
!174 = !DIFile(filename: "kernel/linux/include/asm-generic/int-ll64.h", directory: "/home/hiron/Documents", checksumkind: CSK_MD5, checksum: "12ca7bdb629352cc4c9a492f86b435a7")
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !176, line: 21, baseType: !177)
!176 = !DIFile(filename: "kernel/linux/include/uapi/asm-generic/int-ll64.h", directory: "/home/hiron/Documents", checksumkind: CSK_MD5, checksum: "f4d0ec5bcdd84e825a78a7add39d54dd")
!177 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !170, file: !162, line: 26, baseType: !173, size: 8, offset: 8)
!179 = !DIDerivedType(tag: DW_TAG_member, scope: !166, file: !162, line: 28, baseType: !180, size: 32)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !166, file: !162, line: 28, size: 32, elements: !181)
!181 = !{!182, !185}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "locked_pending", scope: !180, file: !162, line: 29, baseType: !183, size: 16)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !174, line: 19, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !176, line: 24, baseType: !116)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !180, file: !162, line: 30, baseType: !183, size: 16, offset: 16)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !146, file: !145, line: 39, baseType: !187, size: 128, offset: 64)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !115, line: 190, size: 128, elements: !188)
!188 = !{!189, !191}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !187, file: !115, line: 191, baseType: !190, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !187, file: !115, line: 191, baseType: !190, size: 64, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "extra1", scope: !105, file: !104, line: 153, baseType: !111, size: 64, offset: 384)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "extra2", scope: !105, file: !104, line: 154, baseType: !111, size: 64, offset: 448)
!194 = !{!195, !196}
!195 = !DIEnumerator(name: "SYSCTL_TABLE_TYPE_DEFAULT", value: 0)
!196 = !DIEnumerator(name: "SYSCTL_TABLE_TYPE_PERMANENTLY_EMPTY", value: 1)
!197 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "fault_flag", file: !198, line: 1192, baseType: !14, size: 32, elements: !199)
!198 = !DIFile(filename: "kernel/linux/include/linux/mm_types.h", directory: "/home/hiron/Documents", checksumkind: CSK_MD5, checksum: "1b4484a264a3cf6d53406cef05e918ed")
!199 = !{!200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212}
!200 = !DIEnumerator(name: "FAULT_FLAG_WRITE", value: 1)
!201 = !DIEnumerator(name: "FAULT_FLAG_MKWRITE", value: 2)
!202 = !DIEnumerator(name: "FAULT_FLAG_ALLOW_RETRY", value: 4)
!203 = !DIEnumerator(name: "FAULT_FLAG_RETRY_NOWAIT", value: 8)
!204 = !DIEnumerator(name: "FAULT_FLAG_KILLABLE", value: 16)
!205 = !DIEnumerator(name: "FAULT_FLAG_TRIED", value: 32)
!206 = !DIEnumerator(name: "FAULT_FLAG_USER", value: 64)
!207 = !DIEnumerator(name: "FAULT_FLAG_REMOTE", value: 128)
!208 = !DIEnumerator(name: "FAULT_FLAG_INSTRUCTION", value: 256)
!209 = !DIEnumerator(name: "FAULT_FLAG_INTERRUPTIBLE", value: 512)
!210 = !DIEnumerator(name: "FAULT_FLAG_UNSHARE", value: 1024)
!211 = !DIEnumerator(name: "FAULT_FLAG_ORIG_PTE_VALID", value: 2048)
!212 = !DIEnumerator(name: "FAULT_FLAG_VMA_LOCK", value: 4096)
!213 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "page_entry_size", file: !214, line: 536, baseType: !14, size: 32, elements: !215)
!214 = !DIFile(filename: "kernel/linux/include/linux/mm.h", directory: "/home/hiron/Documents", checksumkind: CSK_MD5, checksum: "aeed4f9a0dd96ea2d58accf052fe27ff")
!215 = !{!216, !217, !218}
!216 = !DIEnumerator(name: "PE_SIZE_PTE", value: 0)
!217 = !DIEnumerator(name: "PE_SIZE_PMD", value: 1)
!218 = !DIEnumerator(name: "PE_SIZE_PUD", value: 2)
!219 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uprobe_task_state", file: !220, line: 51, baseType: !14, size: 32, elements: !221)
!220 = !DIFile(filename: "kernel/linux/include/linux/uprobes.h", directory: "/home/hiron/Documents", checksumkind: CSK_MD5, checksum: "f1ebe0639d0680c5b5a7b590bb4dc1cf")
!221 = !{!222, !223, !224, !225}
!222 = !DIEnumerator(name: "UTASK_RUNNING", value: 0)
!223 = !DIEnumerator(name: "UTASK_SSTEP", value: 1)
!224 = !DIEnumerator(name: "UTASK_SSTEP_ACK", value: 2)
!225 = !DIEnumerator(name: "UTASK_SSTEP_TRAPPED", value: 3)
!226 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "perf_event_state", file: !227, line: 593, baseType: !52, size: 32, elements: !228)
!227 = !DIFile(filename: "kernel/linux/include/linux/perf_event.h", directory: "/home/hiron/Documents", checksumkind: CSK_MD5, checksum: "a129daa19fed9983d95de44df7c1ad40")
!228 = !{!229, !230, !231, !232, !233, !234}
!229 = !DIEnumerator(name: "PERF_EVENT_STATE_DEAD", value: -4)
!230 = !DIEnumerator(name: "PERF_EVENT_STATE_EXIT", value: -3)
!231 = !DIEnumerator(name: "PERF_EVENT_STATE_ERROR", value: -2)
!232 = !DIEnumerator(name: "PERF_EVENT_STATE_OFF", value: -1)
!233 = !DIEnumerator(name: "PERF_EVENT_STATE_INACTIVE", value: 0)
!234 = !DIEnumerator(name: "PERF_EVENT_STATE_ACTIVE", value: 1)
!235 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "trace_reg", file: !236, line: 253, baseType: !14, size: 32, elements: !237)
!236 = !DIFile(filename: "kernel/linux/include/linux/trace_events.h", directory: "/home/hiron/Documents", checksumkind: CSK_MD5, checksum: "174a58d19cad76e80e59cb6491327eb9")
!237 = !{!238, !239, !240, !241, !242, !243, !244, !245}
!238 = !DIEnumerator(name: "TRACE_REG_REGISTER", value: 0)
!239 = !DIEnumerator(name: "TRACE_REG_UNREGISTER", value: 1)
!240 = !DIEnumerator(name: "TRACE_REG_PERF_REGISTER", value: 2)
!241 = !DIEnumerator(name: "TRACE_REG_PERF_UNREGISTER", value: 3)
!242 = !DIEnumerator(name: "TRACE_REG_PERF_OPEN", value: 4)
!243 = !DIEnumerator(name: "TRACE_REG_PERF_CLOSE", value: 5)
!244 = !DIEnumerator(name: "TRACE_REG_PERF_ADD", value: 6)
!245 = !DIEnumerator(name: "TRACE_REG_PERF_DEL", value: 7)
!246 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "print_line_t", file: !236, line: 158, baseType: !14, size: 32, elements: !247)
!247 = !{!248, !249, !250, !251}
!248 = !DIEnumerator(name: "TRACE_TYPE_PARTIAL_LINE", value: 0)
!249 = !DIEnumerator(name: "TRACE_TYPE_HANDLED", value: 1)
!250 = !DIEnumerator(name: "TRACE_TYPE_UNHANDLED", value: 2)
!251 = !DIEnumerator(name: "TRACE_TYPE_NO_CONSUME", value: 3)
!252 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ftrace_ops_cmd", file: !253, line: 281, baseType: !14, size: 32, elements: !254)
!253 = !DIFile(filename: "kernel/linux/include/linux/ftrace.h", directory: "/home/hiron/Documents", checksumkind: CSK_MD5, checksum: "a129967f0df581ea6099bb0ee6b5529b")
!254 = !{!255, !256, !257}
!255 = !DIEnumerator(name: "FTRACE_OPS_CMD_ENABLE_SHARE_IPMODIFY_SELF", value: 0)
!256 = !DIEnumerator(name: "FTRACE_OPS_CMD_ENABLE_SHARE_IPMODIFY_PEER", value: 1)
!257 = !DIEnumerator(name: "FTRACE_OPS_CMD_DISABLE_SHARE_IPMODIFY_PEER", value: 2)
!258 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pid_type", file: !259, line: 9, baseType: !14, size: 32, elements: !260)
!259 = !DIFile(filename: "kernel/linux/include/linux/pid.h", directory: "/home/hiron/Documents", checksumkind: CSK_MD5, checksum: "c6c8c3c4044af03e8c0068621cd58605")
!260 = !{!261, !262, !263, !264, !265}
!261 = !DIEnumerator(name: "PIDTYPE_PID", value: 0)
!262 = !DIEnumerator(name: "PIDTYPE_TGID", value: 1)
!263 = !DIEnumerator(name: "PIDTYPE_PGID", value: 2)
!264 = !DIEnumerator(name: "PIDTYPE_SID", value: 3)
!265 = !DIEnumerator(name: "PIDTYPE_MAX", value: 4)
!266 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "memory_type", file: !267, line: 68, baseType: !14, size: 32, elements: !268)
!267 = !DIFile(filename: "kernel/linux/include/linux/memremap.h", directory: "/home/hiron/Documents", checksumkind: CSK_MD5, checksum: "9fdc8a878c73b8b3e2b17b20cbab6564")
!268 = !{!269, !270, !271, !272, !273}
!269 = !DIEnumerator(name: "MEMORY_DEVICE_PRIVATE", value: 1)
!270 = !DIEnumerator(name: "MEMORY_DEVICE_COHERENT", value: 2)
!271 = !DIEnumerator(name: "MEMORY_DEVICE_FS_DAX", value: 3)
!272 = !DIEnumerator(name: "MEMORY_DEVICE_GENERIC", value: 4)
!273 = !DIEnumerator(name: "MEMORY_DEVICE_PCI_P2PDMA", value: 5)
!274 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "migrate_mode", file: !275, line: 15, baseType: !14, size: 32, elements: !276)
!275 = !DIFile(filename: "kernel/linux/include/linux/migrate_mode.h", directory: "/home/hiron/Documents", checksumkind: CSK_MD5, checksum: "2b12e7d4ee7cceca905e3df5cef47de9")
!276 = !{!277, !278, !279, !280}
!277 = !DIEnumerator(name: "MIGRATE_ASYNC", value: 0)
!278 = !DIEnumerator(name: "MIGRATE_SYNC_LIGHT", value: 1)
!279 = !DIEnumerator(name: "MIGRATE_SYNC", value: 2)
!280 = !DIEnumerator(name: "MIGRATE_SYNC_NO_COPY", value: 3)
!281 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "class_map_type", file: !282, line: 59, baseType: !14, size: 32, elements: !283)
!282 = !DIFile(filename: "kernel/linux/include/linux/dynamic_debug.h", directory: "/home/hiron/Documents", checksumkind: CSK_MD5, checksum: "c4304013d54c076c6d943ed73b5d33af")
!283 = !{!284, !285, !286, !287}
!284 = !DIEnumerator(name: "DD_CLASS_TYPE_DISJOINT_BITS", value: 0)
!285 = !DIEnumerator(name: "DD_CLASS_TYPE_LEVEL_NUM", value: 1)
!286 = !DIEnumerator(name: "DD_CLASS_TYPE_DISJOINT_NAMES", value: 2)
!287 = !DIEnumerator(name: "DD_CLASS_TYPE_LEVEL_NAMES", value: 3)
!288 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quota_type", file: !289, line: 54, baseType: !14, size: 32, elements: !290)
!289 = !DIFile(filename: "kernel/linux/include/linux/quota.h", directory: "/home/hiron/Documents", checksumkind: CSK_MD5, checksum: "8f080db39d58e181bad04637d68ed8d4")
!290 = !{!291, !292, !293}
!291 = !DIEnumerator(name: "USRQUOTA", value: 0)
!292 = !DIEnumerator(name: "GRPQUOTA", value: 1)
!293 = !DIEnumerator(name: "PRJQUOTA", value: 2)
!294 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "inode_i_mutex_lock_class", file: !295, line: 759, baseType: !14, size: 32, elements: !296)
!295 = !DIFile(filename: "kernel/linux/include/linux/fs.h", directory: "/home/hiron/Documents", checksumkind: CSK_MD5, checksum: "4bc99607c61508470b699d4eb782682d")
!296 = !{!297, !298, !299, !300, !301, !302}
!297 = !DIEnumerator(name: "I_MUTEX_NORMAL", value: 0)
!298 = !DIEnumerator(name: "I_MUTEX_PARENT", value: 1)
!299 = !DIEnumerator(name: "I_MUTEX_CHILD", value: 2)
!300 = !DIEnumerator(name: "I_MUTEX_XATTR", value: 3)
!301 = !DIEnumerator(name: "I_MUTEX_NONDIR2", value: 4)
!302 = !DIEnumerator(name: "I_MUTEX_PARENT2", value: 5)
!303 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !304, line: 18, baseType: !14, size: 32, elements: !305)
!304 = !DIFile(filename: "kernel/linux/include/linux/namei.h", directory: "/home/hiron/Documents", checksumkind: CSK_MD5, checksum: "661c5a60bb5f888b1125c4324650f35a")
!305 = !{!306, !307, !308, !309}
!306 = !DIEnumerator(name: "LAST_NORM", value: 0)
!307 = !DIEnumerator(name: "LAST_ROOT", value: 1)
!308 = !DIEnumerator(name: "LAST_DOT", value: 2)
!309 = !DIEnumerator(name: "LAST_DOTDOT", value: 3)
!310 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !311, line: 356, baseType: !14, size: 32, elements: !312)
!311 = !DIFile(filename: "kernel/linux/include/linux/slab.h", directory: "/home/hiron/Documents", checksumkind: CSK_MD5, checksum: "3d48f31ee90b2f0326a951718a31b694")
!312 = !{!313, !314, !315, !316, !317}
!313 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0)
!314 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1)
!315 = !DIEnumerator(name: "KMALLOC_DMA", value: 2)
!316 = !DIEnumerator(name: "KMALLOC_CGROUP", value: 3)
!317 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 4)
!318 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "refcount_saturation_type", file: !319, line: 119, baseType: !14, size: 32, elements: !320)
!319 = !DIFile(filename: "kernel/linux/include/linux/refcount.h", directory: "/home/hiron/Documents", checksumkind: CSK_MD5, checksum: "e7caf801ca057628e7b6cce80f0a5d10")
!320 = !{!321, !322, !323, !324, !325}
!321 = !DIEnumerator(name: "REFCOUNT_ADD_NOT_ZERO_OVF", value: 0)
!322 = !DIEnumerator(name: "REFCOUNT_ADD_OVF", value: 1)
!323 = !DIEnumerator(name: "REFCOUNT_ADD_UAF", value: 2)
!324 = !DIEnumerator(name: "REFCOUNT_SUB_UAF", value: 3)
!325 = !DIEnumerator(name: "REFCOUNT_DEC_LEAK", value: 4)
!326 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !2, line: 1749, baseType: !14, size: 32, elements: !327)
!327 = !{!328, !329, !330}
!328 = !DIEnumerator(name: "WALK_TRAILING", value: 1)
!329 = !DIEnumerator(name: "WALK_MORE", value: 2)
!330 = !DIEnumerator(name: "WALK_NOFOLLOW", value: 4)
!331 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "fsnotify_data_type", file: !332, line: 286, baseType: !14, size: 32, elements: !333)
!332 = !DIFile(filename: "kernel/linux/include/linux/fsnotify_backend.h", directory: "/home/hiron/Documents", checksumkind: CSK_MD5, checksum: "843cf0d23de170faef429e4c958dfd75")
!333 = !{!334, !335, !336, !337, !338}
!334 = !DIEnumerator(name: "FSNOTIFY_EVENT_NONE", value: 0)
!335 = !DIEnumerator(name: "FSNOTIFY_EVENT_PATH", value: 1)
!336 = !DIEnumerator(name: "FSNOTIFY_EVENT_INODE", value: 2)
!337 = !DIEnumerator(name: "FSNOTIFY_EVENT_DENTRY", value: 3)
!338 = !DIEnumerator(name: "FSNOTIFY_EVENT_ERROR", value: 4)
!339 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pageflags", file: !340, line: 100, baseType: !14, size: 32, elements: !341)
!340 = !DIFile(filename: "kernel/linux/include/linux/page-flags.h", directory: "/home/hiron/Documents", checksumkind: CSK_MD5, checksum: "0f65217a2d2d141bea590e8323cff045")
!341 = !{!342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381}
!342 = !DIEnumerator(name: "PG_locked", value: 0)
!343 = !DIEnumerator(name: "PG_referenced", value: 1)
!344 = !DIEnumerator(name: "PG_uptodate", value: 2)
!345 = !DIEnumerator(name: "PG_dirty", value: 3)
!346 = !DIEnumerator(name: "PG_lru", value: 4)
!347 = !DIEnumerator(name: "PG_active", value: 5)
!348 = !DIEnumerator(name: "PG_workingset", value: 6)
!349 = !DIEnumerator(name: "PG_waiters", value: 7)
!350 = !DIEnumerator(name: "PG_error", value: 8)
!351 = !DIEnumerator(name: "PG_slab", value: 9)
!352 = !DIEnumerator(name: "PG_owner_priv_1", value: 10)
!353 = !DIEnumerator(name: "PG_arch_1", value: 11)
!354 = !DIEnumerator(name: "PG_reserved", value: 12)
!355 = !DIEnumerator(name: "PG_private", value: 13)
!356 = !DIEnumerator(name: "PG_private_2", value: 14)
!357 = !DIEnumerator(name: "PG_writeback", value: 15)
!358 = !DIEnumerator(name: "PG_head", value: 16)
!359 = !DIEnumerator(name: "PG_mappedtodisk", value: 17)
!360 = !DIEnumerator(name: "PG_reclaim", value: 18)
!361 = !DIEnumerator(name: "PG_swapbacked", value: 19)
!362 = !DIEnumerator(name: "PG_unevictable", value: 20)
!363 = !DIEnumerator(name: "PG_mlocked", value: 21)
!364 = !DIEnumerator(name: "PG_uncached", value: 22)
!365 = !DIEnumerator(name: "PG_hwpoison", value: 23)
!366 = !DIEnumerator(name: "PG_young", value: 24)
!367 = !DIEnumerator(name: "PG_idle", value: 25)
!368 = !DIEnumerator(name: "__NR_PAGEFLAGS", value: 26)
!369 = !DIEnumerator(name: "PG_readahead", value: 18)
!370 = !DIEnumerator(name: "PG_anon_exclusive", value: 17)
!371 = !DIEnumerator(name: "PG_checked", value: 10)
!372 = !DIEnumerator(name: "PG_swapcache", value: 10)
!373 = !DIEnumerator(name: "PG_fscache", value: 14)
!374 = !DIEnumerator(name: "PG_pinned", value: 10)
!375 = !DIEnumerator(name: "PG_savepinned", value: 3)
!376 = !DIEnumerator(name: "PG_foreign", value: 10)
!377 = !DIEnumerator(name: "PG_xen_remapped", value: 10)
!378 = !DIEnumerator(name: "PG_has_hwpoisoned", value: 8)
!379 = !DIEnumerator(name: "PG_isolated", value: 18)
!380 = !DIEnumerator(name: "PG_reported", value: 2)
!381 = !DIEnumerator(name: "PG_vmemmap_self_hosted", value: 10)
!382 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "zone_type", file: !383, line: 716, baseType: !14, size: 32, elements: !384)
!383 = !DIFile(filename: "kernel/linux/include/linux/mmzone.h", directory: "/home/hiron/Documents", checksumkind: CSK_MD5, checksum: "2b40a560f34dd347f8626cebaa517b24")
!384 = !{!385, !386, !387, !388, !389, !390}
!385 = !DIEnumerator(name: "ZONE_DMA", value: 0)
!386 = !DIEnumerator(name: "ZONE_DMA32", value: 1)
!387 = !DIEnumerator(name: "ZONE_NORMAL", value: 2)
!388 = !DIEnumerator(name: "ZONE_MOVABLE", value: 3)
!389 = !DIEnumerator(name: "ZONE_DEVICE", value: 4)
!390 = !DIEnumerator(name: "__MAX_NR_ZONES", value: 5)
!391 = !{!392, !393, !111, !125, !129, !394, !397, !399, !402, !816, !14, !7972, !1651, !797, !7975, !1083, !414, !421, !5416, !4679, !991, !7976, !856, !1007, !7979, !7982, !52, !108, !114, !7984, !7987, !2771, !7990, !7993, !7994, !7995, !7350, !1884}
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !115, line: 154, baseType: !14)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !174, line: 23, baseType: !395)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !176, line: 31, baseType: !396)
!396 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !174, line: 21, baseType: !398)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !176, line: 27, baseType: !14)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !401)
!401 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !14)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !404)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cred", file: !405, line: 110, size: 1408, elements: !406)
!405 = !DIFile(filename: "kernel/linux/include/linux/cred.h", directory: "/home/hiron/Documents", checksumkind: CSK_MD5, checksum: "8134f466324390c4d6e0b62053232854")
!406 = !{!407, !408, !416, !423, !424, !425, !426, !427, !428, !429, !430, !436, !437, !438, !439, !440, !441, !601, !602, !603, !604, !605, !643, !800, !801, !811}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !404, file: !405, line: 111, baseType: !139, size: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !404, file: !405, line: 119, baseType: !409, size: 32, offset: 32)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "kuid_t", file: !410, line: 23, baseType: !411)
!410 = !DIFile(filename: "kernel/linux/include/linux/uidgid.h", directory: "/home/hiron/Documents", checksumkind: CSK_MD5, checksum: "a58253b1216c6e90ad8db58db462410d")
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !410, line: 21, size: 32, elements: !412)
!412 = !{!413}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !411, file: !410, line: 22, baseType: !414, size: 32)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !115, line: 37, baseType: !415)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_uid32_t", file: !127, line: 49, baseType: !14)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !404, file: !405, line: 120, baseType: !417, size: 32, offset: 64)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "kgid_t", file: !410, line: 28, baseType: !418)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !410, line: 26, size: 32, elements: !419)
!419 = !{!420}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !418, file: !410, line: 27, baseType: !421, size: 32)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !115, line: 38, baseType: !422)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_gid32_t", file: !127, line: 50, baseType: !14)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "suid", scope: !404, file: !405, line: 121, baseType: !409, size: 32, offset: 96)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "sgid", scope: !404, file: !405, line: 122, baseType: !417, size: 32, offset: 128)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "euid", scope: !404, file: !405, line: 123, baseType: !409, size: 32, offset: 160)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "egid", scope: !404, file: !405, line: 124, baseType: !417, size: 32, offset: 192)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "fsuid", scope: !404, file: !405, line: 125, baseType: !409, size: 32, offset: 224)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "fsgid", scope: !404, file: !405, line: 126, baseType: !417, size: 32, offset: 256)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "securebits", scope: !404, file: !405, line: 127, baseType: !14, size: 32, offset: 288)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "cap_inheritable", scope: !404, file: !405, line: 128, baseType: !431, size: 64, offset: 320)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "kernel_cap_t", file: !432, line: 24, baseType: !433)
!432 = !DIFile(filename: "kernel/linux/include/linux/capability.h", directory: "/home/hiron/Documents", checksumkind: CSK_MD5, checksum: "844d16bbc1c5d5ddd3d4dd45f55bc1eb")
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !432, line: 24, size: 64, elements: !434)
!434 = !{!435}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !433, file: !432, line: 24, baseType: !394, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "cap_permitted", scope: !404, file: !405, line: 129, baseType: !431, size: 64, offset: 384)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "cap_effective", scope: !404, file: !405, line: 130, baseType: !431, size: 64, offset: 448)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "cap_bset", scope: !404, file: !405, line: 131, baseType: !431, size: 64, offset: 512)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "cap_ambient", scope: !404, file: !405, line: 132, baseType: !431, size: 64, offset: 576)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "jit_keyring", scope: !404, file: !405, line: 134, baseType: !177, size: 8, offset: 640)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "session_keyring", scope: !404, file: !405, line: 136, baseType: !442, size: 64, offset: 704)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "key", file: !444, line: 195, size: 1792, elements: !445)
!444 = !DIFile(filename: "kernel/linux/include/linux/key.h", directory: "/home/hiron/Documents", checksumkind: CSK_MD5, checksum: "d53fafbe45ee20e0375ce810c4e5dab2")
!445 = !{!446, !451, !456, !468, !471, !493, !496, !497, !504, !505, !506, !507, !510, !511, !512, !514, !515, !563, !586}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !443, file: !444, line: 196, baseType: !447, size: 32)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !319, line: 113, baseType: !448)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !319, line: 111, size: 32, elements: !449)
!449 = !{!450}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !448, file: !319, line: 112, baseType: !139, size: 32)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !443, file: !444, line: 197, baseType: !452, size: 32, offset: 32)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "key_serial_t", file: !444, line: 28, baseType: !453)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !115, line: 104, baseType: !454)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "s32", file: !174, line: 20, baseType: !455)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !176, line: 26, baseType: !52)
!456 = !DIDerivedType(tag: DW_TAG_member, scope: !443, file: !444, line: 198, baseType: !457, size: 192, offset: 64)
!457 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !443, file: !444, line: 198, size: 192, elements: !458)
!458 = !{!459, !460}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "graveyard_link", scope: !457, file: !444, line: 199, baseType: !187, size: 128)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "serial_node", scope: !457, file: !444, line: 200, baseType: !461, size: 192, align: 64)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !462, line: 5, size: 192, align: 64, elements: !463)
!462 = !DIFile(filename: "kernel/linux/include/linux/rbtree_types.h", directory: "/home/hiron/Documents", checksumkind: CSK_MD5, checksum: "8417af8a8bff2c6b1a545902a3b285de")
!463 = !{!464, !465, !467}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !461, file: !462, line: 6, baseType: !129, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !461, file: !462, line: 7, baseType: !466, size: 64, offset: 64)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !461, file: !462, line: 8, baseType: !466, size: 64, offset: 128)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "watchers", scope: !443, file: !444, line: 203, baseType: !469, size: 64, offset: 256)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DICompositeType(tag: DW_TAG_structure_type, name: "watch_list", file: !444, line: 203, flags: DIFlagFwdDecl)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !443, file: !444, line: 205, baseType: !472, size: 320, offset: 320)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rw_semaphore", file: !473, line: 48, size: 320, elements: !474)
!473 = !DIFile(filename: "kernel/linux/include/linux/rwsem.h", directory: "/home/hiron/Documents", checksumkind: CSK_MD5, checksum: "27edc7e0af8a1693f9adbf58deac1a18")
!474 = !{!475, !484, !485, !490, !492}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !472, file: !473, line: 49, baseType: !476, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !477, line: 13, baseType: !478)
!477 = !DIFile(filename: "kernel/linux/include/linux/atomic/atomic-long.h", directory: "/home/hiron/Documents", checksumkind: CSK_MD5, checksum: "a2e16419cf0734d1c963b754e2487002")
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !115, line: 181, baseType: !479)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !115, line: 179, size: 64, elements: !480)
!480 = !{!481}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !479, file: !115, line: 180, baseType: !482, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !174, line: 22, baseType: !483)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !176, line: 30, baseType: !133)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !472, file: !473, line: 55, baseType: !476, size: 64, offset: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "osq", scope: !472, file: !473, line: 57, baseType: !486, size: 32, offset: 128)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "optimistic_spin_queue", file: !487, line: 15, size: 32, elements: !488)
!487 = !DIFile(filename: "kernel/linux/include/linux/osq_lock.h", directory: "/home/hiron/Documents", checksumkind: CSK_MD5, checksum: "96068aa09fa474bd706a2c16987ff9d4")
!488 = !{!489}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !486, file: !487, line: 20, baseType: !139, size: 32)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !472, file: !473, line: 59, baseType: !491, size: 32, offset: 160)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !158, line: 23, baseType: !157)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !472, file: !473, line: 60, baseType: !187, size: 128, offset: 192)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !443, file: !444, line: 206, baseType: !494, size: 64, offset: 640)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DICompositeType(tag: DW_TAG_structure_type, name: "key_user", file: !444, line: 206, flags: DIFlagFwdDecl)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "security", scope: !443, file: !444, line: 207, baseType: !111, size: 64, offset: 704)
!497 = !DIDerivedType(tag: DW_TAG_member, scope: !443, file: !444, line: 208, baseType: !498, size: 64, offset: 768)
!498 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !443, file: !444, line: 208, size: 64, elements: !499)
!499 = !{!500, !503}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "expiry", scope: !498, file: !444, line: 209, baseType: !501, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "time64_t", file: !502, line: 8, baseType: !483)
!502 = !DIFile(filename: "kernel/linux/include/linux/time64.h", directory: "/home/hiron/Documents", checksumkind: CSK_MD5, checksum: "d597827474cd37ab3c64b0e07d237cd6")
!503 = !DIDerivedType(tag: DW_TAG_member, name: "revoked_at", scope: !498, file: !444, line: 210, baseType: !501, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "last_used_at", scope: !443, file: !444, line: 212, baseType: !501, size: 64, offset: 832)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !443, file: !444, line: 213, baseType: !409, size: 32, offset: 896)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !443, file: !444, line: 214, baseType: !417, size: 32, offset: 928)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !443, file: !444, line: 215, baseType: !508, size: 32, offset: 960)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "key_perm_t", file: !444, line: 31, baseType: !509)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !115, line: 110, baseType: !397)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "quotalen", scope: !443, file: !444, line: 216, baseType: !116, size: 16, offset: 992)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "datalen", scope: !443, file: !444, line: 217, baseType: !116, size: 16, offset: 1008)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !443, file: !444, line: 221, baseType: !513, size: 16, offset: 1024)
!513 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !443, file: !444, line: 228, baseType: !129, size: 64, offset: 1088)
!515 = !DIDerivedType(tag: DW_TAG_member, scope: !443, file: !444, line: 245, baseType: !516, size: 320, offset: 1152)
!516 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !443, file: !444, line: 245, size: 320, elements: !517)
!517 = !{!518, !555}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "index_key", scope: !516, file: !444, line: 246, baseType: !519, size: 320)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "keyring_index_key", file: !444, line: 114, size: 320, elements: !520)
!520 = !{!521, !522, !534, !537, !554}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !519, file: !444, line: 116, baseType: !129, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, scope: !519, file: !444, line: 117, baseType: !523, size: 64, offset: 64)
!523 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !519, file: !444, line: 117, size: 64, elements: !524)
!524 = !{!525, !533}
!525 = !DIDerivedType(tag: DW_TAG_member, scope: !523, file: !444, line: 118, baseType: !526, size: 64)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !523, file: !444, line: 118, size: 64, elements: !527)
!527 = !{!528, !529}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "desc_len", scope: !526, file: !444, line: 120, baseType: !183, size: 16)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !526, file: !444, line: 121, baseType: !530, size: 48, offset: 16)
!530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !531)
!531 = !{!532}
!532 = !DISubrange(count: 6)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !523, file: !444, line: 127, baseType: !129, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !519, file: !444, line: 129, baseType: !535, size: 64, offset: 128)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DICompositeType(tag: DW_TAG_structure_type, name: "key_type", file: !444, line: 102, flags: DIFlagFwdDecl)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "domain_tag", scope: !519, file: !444, line: 130, baseType: !538, size: 64, offset: 192)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "key_tag", file: !444, line: 108, size: 192, elements: !540)
!540 = !{!541, !550, !551}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "rcu", scope: !539, file: !444, line: 109, baseType: !542, size: 128, align: 64)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !115, line: 232, size: 128, align: 64, elements: !543)
!543 = !{!544, !546}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !542, file: !115, line: 233, baseType: !545, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !542, file: !115, line: 234, baseType: !547, size: 64, offset: 64)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DISubroutineType(types: !549)
!549 = !{null, !545}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !539, file: !444, line: 110, baseType: !447, size: 32, offset: 128)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "removed", scope: !539, file: !444, line: 111, baseType: !552, size: 8, offset: 160)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !115, line: 35, baseType: !553)
!553 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !519, file: !444, line: 131, baseType: !108, size: 64, offset: 256)
!555 = !DIDerivedType(tag: DW_TAG_member, scope: !516, file: !444, line: 247, baseType: !556, size: 320)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !516, file: !444, line: 247, size: 320, elements: !557)
!557 = !{!558, !559, !560, !561, !562}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !556, file: !444, line: 248, baseType: !129, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "len_desc", scope: !556, file: !444, line: 249, baseType: !129, size: 64, offset: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !556, file: !444, line: 250, baseType: !535, size: 64, offset: 128)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "domain_tag", scope: !556, file: !444, line: 251, baseType: !538, size: 64, offset: 192)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !556, file: !444, line: 252, baseType: !393, size: 64, offset: 256)
!563 = !DIDerivedType(tag: DW_TAG_member, scope: !443, file: !444, line: 260, baseType: !564, size: 256, offset: 1472)
!564 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !443, file: !444, line: 260, size: 256, elements: !565)
!565 = !{!566, !574}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !564, file: !444, line: 261, baseType: !567, size: 256)
!567 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "key_payload", file: !444, line: 134, size: 256, elements: !568)
!568 = !{!569, !570}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "rcu_data0", scope: !567, file: !444, line: 135, baseType: !111, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !567, file: !444, line: 136, baseType: !571, size: 256)
!571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 256, elements: !572)
!572 = !{!573}
!573 = !DISubrange(count: 4)
!574 = !DIDerivedType(tag: DW_TAG_member, scope: !564, file: !444, line: 262, baseType: !575, size: 256)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !564, file: !444, line: 262, size: 256, elements: !576)
!576 = !{!577, !578}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "name_link", scope: !575, file: !444, line: 264, baseType: !187, size: 128)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !575, file: !444, line: 265, baseType: !579, size: 128, offset: 128)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "assoc_array", file: !580, line: 22, size: 128, elements: !581)
!580 = !DIFile(filename: "kernel/linux/include/linux/assoc_array.h", directory: "/home/hiron/Documents", checksumkind: CSK_MD5, checksum: "12a70c11037debe270cf6b506589459e")
!581 = !{!582, !585}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !579, file: !580, line: 23, baseType: !583, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DICompositeType(tag: DW_TAG_structure_type, name: "assoc_array_ptr", file: !580, line: 23, flags: DIFlagFwdDecl)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "nr_leaves_on_tree", scope: !579, file: !580, line: 24, baseType: !129, size: 64, offset: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_link", scope: !443, file: !444, line: 280, baseType: !587, size: 64, offset: 1728)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "key_restriction", file: !444, line: 176, size: 192, elements: !589)
!589 = !{!590, !599, !600}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !588, file: !444, line: 177, baseType: !591, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "key_restrict_link_func_t", file: !444, line: 171, baseType: !592)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DISubroutineType(types: !594)
!594 = !{!52, !442, !595, !597, !442}
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !536)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !567)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !588, file: !444, line: 178, baseType: !442, size: 64, offset: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "keytype", scope: !588, file: !444, line: 179, baseType: !535, size: 64, offset: 128)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "process_keyring", scope: !404, file: !405, line: 137, baseType: !442, size: 64, offset: 768)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "thread_keyring", scope: !404, file: !405, line: 138, baseType: !442, size: 64, offset: 832)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "request_key_auth", scope: !404, file: !405, line: 139, baseType: !442, size: 64, offset: 896)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "security", scope: !404, file: !405, line: 142, baseType: !111, size: 64, offset: 960)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !404, file: !405, line: 144, baseType: !606, size: 64, offset: 1024)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "user_struct", file: !608, line: 14, size: 1152, elements: !609)
!608 = !DIFile(filename: "kernel/linux/include/linux/sched/user.h", directory: "/home/hiron/Documents", checksumkind: CSK_MD5, checksum: "5b9b728b5daa0648e64b85855f2d2d7d")
!609 = !{!610, !611, !620, !621, !622, !629, !630, !631, !632}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !607, file: !608, line: 15, baseType: !447, size: 32)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_watches", scope: !607, file: !608, line: 17, baseType: !612, size: 320, offset: 64)
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "percpu_counter", file: !613, line: 22, size: 320, elements: !614)
!613 = !DIFile(filename: "kernel/linux/include/linux/percpu_counter.h", directory: "/home/hiron/Documents", checksumkind: CSK_MD5, checksum: "bd30afdeb73c1a654ed371bd10641877")
!614 = !{!615, !616, !617, !618}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !612, file: !613, line: 23, baseType: !491, size: 32)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !612, file: !613, line: 24, baseType: !482, size: 64, offset: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !612, file: !613, line: 26, baseType: !187, size: 128, offset: 128)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "counters", scope: !612, file: !613, line: 28, baseType: !619, size: 64, offset: 256)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "unix_inflight", scope: !607, file: !608, line: 19, baseType: !129, size: 64, offset: 384)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "pipe_bufs", scope: !607, file: !608, line: 20, baseType: !476, size: 64, offset: 448)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "uidhash_node", scope: !607, file: !608, line: 23, baseType: !623, size: 128, offset: 512)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !115, line: 198, size: 128, elements: !624)
!624 = !{!625, !627}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !623, file: !115, line: 199, baseType: !626, size: 64)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !623, file: !115, line: 199, baseType: !628, size: 64, offset: 64)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !607, file: !608, line: 24, baseType: !409, size: 32, offset: 640)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "locked_vm", scope: !607, file: !608, line: 29, baseType: !476, size: 64, offset: 704)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "nr_watches", scope: !607, file: !608, line: 32, baseType: !139, size: 32, offset: 768)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "ratelimit", scope: !607, file: !608, line: 36, baseType: !633, size: 320, offset: 832)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ratelimit_state", file: !634, line: 15, size: 320, elements: !635)
!634 = !DIFile(filename: "kernel/linux/include/linux/ratelimit_types.h", directory: "/home/hiron/Documents", checksumkind: CSK_MD5, checksum: "8a7f0c4e20ae16dd6d451be3252397df")
!635 = !{!636, !637, !638, !639, !640, !641, !642}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !633, file: !634, line: 16, baseType: !491, size: 32)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "interval", scope: !633, file: !634, line: 18, baseType: !52, size: 32, offset: 32)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "burst", scope: !633, file: !634, line: 19, baseType: !52, size: 32, offset: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "printed", scope: !633, file: !634, line: 20, baseType: !52, size: 32, offset: 96)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "missed", scope: !633, file: !634, line: 21, baseType: !52, size: 32, offset: 128)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !633, file: !634, line: 22, baseType: !129, size: 64, offset: 192)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !633, file: !634, line: 23, baseType: !129, size: 64, offset: 256)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "user_ns", scope: !404, file: !405, line: 145, baseType: !644, size: 64, offset: 1088)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "user_namespace", file: !646, line: 68, size: 4992, elements: !647)
!646 = !DIFile(filename: "kernel/linux/include/linux/user_namespace.h", directory: "/home/hiron/Documents", checksumkind: CSK_MD5, checksum: "e33da7d7f5807cddffee70ee5683e5f4")
!647 = !{!648, !670, !671, !672, !673, !674, !675, !676, !687, !688, !689, !690, !691, !692, !693, !705, !780, !781, !795, !798}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "uid_map", scope: !645, file: !646, line: 69, baseType: !649, size: 576)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uid_gid_map", file: !646, line: 23, size: 576, elements: !650)
!650 = !{!651, !652}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "nr_extents", scope: !649, file: !646, line: 24, baseType: !397, size: 32)
!652 = !DIDerivedType(tag: DW_TAG_member, scope: !649, file: !646, line: 25, baseType: !653, size: 512, offset: 64)
!653 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !649, file: !646, line: 25, size: 512, elements: !654)
!654 = !{!655, !664}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !653, file: !646, line: 26, baseType: !656, size: 480)
!656 = !DICompositeType(tag: DW_TAG_array_type, baseType: !657, size: 480, elements: !662)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uid_gid_extent", file: !646, line: 17, size: 96, elements: !658)
!658 = !{!659, !660, !661}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !657, file: !646, line: 18, baseType: !397, size: 32)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "lower_first", scope: !657, file: !646, line: 19, baseType: !397, size: 32, offset: 32)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !657, file: !646, line: 20, baseType: !397, size: 32, offset: 64)
!662 = !{!663}
!663 = !DISubrange(count: 5)
!664 = !DIDerivedType(tag: DW_TAG_member, scope: !653, file: !646, line: 27, baseType: !665, size: 128)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !653, file: !646, line: 27, size: 128, elements: !666)
!666 = !{!667, !669}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "forward", scope: !665, file: !646, line: 28, baseType: !668, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "reverse", scope: !665, file: !646, line: 29, baseType: !668, size: 64, offset: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "gid_map", scope: !645, file: !646, line: 70, baseType: !649, size: 576, offset: 576)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "projid_map", scope: !645, file: !646, line: 71, baseType: !649, size: 576, offset: 1152)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !645, file: !646, line: 72, baseType: !644, size: 64, offset: 1728)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !645, file: !646, line: 73, baseType: !52, size: 32, offset: 1792)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !645, file: !646, line: 74, baseType: !409, size: 32, offset: 1824)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !645, file: !646, line: 75, baseType: !417, size: 32, offset: 1856)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !645, file: !646, line: 76, baseType: !677, size: 192, offset: 1920)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ns_common", file: !678, line: 9, size: 192, elements: !679)
!678 = !DIFile(filename: "kernel/linux/include/linux/ns_common.h", directory: "/home/hiron/Documents", checksumkind: CSK_MD5, checksum: "ee32b998ca2668ab19e0ae22cd52a10b")
!679 = !{!680, !681, !685, !686}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "stashed", scope: !677, file: !678, line: 10, baseType: !476, size: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !677, file: !678, line: 11, baseType: !682, size: 64, offset: 64)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !684)
!684 = !DICompositeType(tag: DW_TAG_structure_type, name: "proc_ns_operations", file: !678, line: 7, flags: DIFlagFwdDecl)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "inum", scope: !677, file: !678, line: 12, baseType: !14, size: 32, offset: 128)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !677, file: !678, line: 13, baseType: !447, size: 32, offset: 160)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !645, file: !646, line: 77, baseType: !129, size: 64, offset: 2112)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "parent_could_setfcap", scope: !645, file: !646, line: 80, baseType: !552, size: 8, offset: 2176)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "keyring_name_list", scope: !645, file: !646, line: 88, baseType: !187, size: 128, offset: 2240)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "user_keyring_register", scope: !645, file: !646, line: 89, baseType: !442, size: 64, offset: 2368)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "keyring_sem", scope: !645, file: !646, line: 90, baseType: !472, size: 320, offset: 2432)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "persistent_keyring_register", scope: !645, file: !646, line: 95, baseType: !442, size: 64, offset: 2752)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !645, file: !646, line: 97, baseType: !694, size: 256, offset: 2816)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "work_struct", file: !695, line: 98, size: 256, elements: !696)
!695 = !DIFile(filename: "kernel/linux/include/linux/workqueue.h", directory: "/home/hiron/Documents", checksumkind: CSK_MD5, checksum: "277571a10722a52b035540b727012e50")
!696 = !{!697, !698, !699}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !694, file: !695, line: 99, baseType: !476, size: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !694, file: !695, line: 100, baseType: !187, size: 128, offset: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !694, file: !695, line: 101, baseType: !700, size: 64, offset: 192)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "work_func_t", file: !695, line: 21, baseType: !701)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DISubroutineType(types: !703)
!703 = !{null, !704}
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !645, file: !646, line: 99, baseType: !706, size: 768, offset: 3072)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ctl_table_set", file: !104, line: 189, size: 768, elements: !707)
!707 = !{!708, !713}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "is_seen", scope: !706, file: !104, line: 190, baseType: !709, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DISubroutineType(types: !711)
!711 = !{!52, !712}
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !706, file: !104, line: 191, baseType: !714, size: 704, offset: 64)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ctl_dir", file: !104, line: 183, size: 704, elements: !715)
!715 = !{!716, !776}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !714, file: !104, line: 185, baseType: !717, size: 640)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ctl_table_header", file: !104, line: 164, size: 640, elements: !718)
!718 = !{!719, !730, !742, !743, !763, !764, !766, !772}
!719 = !DIDerivedType(tag: DW_TAG_member, scope: !717, file: !104, line: 165, baseType: !720, size: 192)
!720 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !717, file: !104, line: 165, size: 192, elements: !721)
!721 = !{!722, !729}
!722 = !DIDerivedType(tag: DW_TAG_member, scope: !720, file: !104, line: 166, baseType: !723, size: 192)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !720, file: !104, line: 166, size: 192, elements: !724)
!724 = !{!725, !726, !727, !728}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "ctl_table", scope: !723, file: !104, line: 167, baseType: !123, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !723, file: !104, line: 168, baseType: !52, size: 32, offset: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !723, file: !104, line: 169, baseType: !52, size: 32, offset: 96)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "nreg", scope: !723, file: !104, line: 170, baseType: !52, size: 32, offset: 128)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "rcu", scope: !720, file: !104, line: 172, baseType: !542, size: 128, align: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "unregistering", scope: !717, file: !104, line: 174, baseType: !731, size: 64, offset: 192)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "completion", file: !733, line: 26, size: 256, elements: !734)
!733 = !DIFile(filename: "kernel/linux/include/linux/completion.h", directory: "/home/hiron/Documents", checksumkind: CSK_MD5, checksum: "1a591b3cacf1992e38b7e9ed15e1d8c7")
!734 = !{!735, !736}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !732, file: !733, line: 27, baseType: !14, size: 32)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !732, file: !733, line: 28, baseType: !737, size: 192, offset: 64)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "swait_queue_head", file: !738, line: 43, size: 192, elements: !739)
!738 = !DIFile(filename: "kernel/linux/include/linux/swait.h", directory: "/home/hiron/Documents", checksumkind: CSK_MD5, checksum: "426b09bb279807aa78d8e2ce484d86d2")
!739 = !{!740, !741}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !737, file: !738, line: 44, baseType: !491, size: 32)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "task_list", scope: !737, file: !738, line: 45, baseType: !187, size: 128, offset: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "ctl_table_arg", scope: !717, file: !104, line: 175, baseType: !123, size: 64, offset: 256)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !717, file: !104, line: 176, baseType: !744, size: 64, offset: 320)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ctl_table_root", file: !104, line: 194, size: 960, elements: !746)
!746 = !{!747, !748, !752, !759}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "default_set", scope: !745, file: !104, line: 195, baseType: !706, size: 768)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "lookup", scope: !745, file: !104, line: 196, baseType: !749, size: 64, offset: 768)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DISubroutineType(types: !751)
!751 = !{!712, !744}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "set_ownership", scope: !745, file: !104, line: 197, baseType: !753, size: 64, offset: 832)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DISubroutineType(types: !755)
!755 = !{null, !756, !123, !757, !758}
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "permissions", scope: !745, file: !104, line: 200, baseType: !760, size: 64, offset: 896)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DISubroutineType(types: !762)
!762 = !{!52, !756, !123}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !717, file: !104, line: 177, baseType: !712, size: 64, offset: 384)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !717, file: !104, line: 178, baseType: !765, size: 64, offset: 448)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !717, file: !104, line: 179, baseType: !767, size: 64, offset: 512)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ctl_node", file: !104, line: 157, size: 256, elements: !769)
!769 = !{!770, !771}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !768, file: !104, line: 158, baseType: !461, size: 192, align: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !768, file: !104, line: 159, baseType: !756, size: 64, offset: 192)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "inodes", scope: !717, file: !104, line: 180, baseType: !773, size: 64, offset: 576)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !115, line: 194, size: 64, elements: !774)
!774 = !{!775}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !773, file: !115, line: 195, baseType: !626, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !714, file: !104, line: 186, baseType: !777, size: 64, offset: 640)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !462, line: 12, size: 64, elements: !778)
!778 = !{!779}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !777, file: !462, line: 13, baseType: !466, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "sysctls", scope: !645, file: !646, line: 100, baseType: !756, size: 64, offset: 3840)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "ucounts", scope: !645, file: !646, line: 102, baseType: !782, size: 64, offset: 3904)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ucounts", file: !646, line: 107, size: 1280, elements: !784)
!784 = !{!785, !786, !787, !788, !789, !793}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !783, file: !646, line: 108, baseType: !623, size: 128)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !783, file: !646, line: 109, baseType: !644, size: 64, offset: 128)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !783, file: !646, line: 110, baseType: !409, size: 32, offset: 192)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !783, file: !646, line: 111, baseType: !139, size: 32, offset: 224)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "ucount", scope: !783, file: !646, line: 112, baseType: !790, size: 768, offset: 256)
!790 = !DICompositeType(tag: DW_TAG_array_type, baseType: !476, size: 768, elements: !791)
!791 = !{!792}
!792 = !DISubrange(count: 12)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "rlimit", scope: !783, file: !646, line: 113, baseType: !794, size: 256, offset: 1024)
!794 = !DICompositeType(tag: DW_TAG_array_type, baseType: !476, size: 256, elements: !572)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "ucount_max", scope: !645, file: !646, line: 103, baseType: !796, size: 768, offset: 3968)
!796 = !DICompositeType(tag: DW_TAG_array_type, baseType: !797, size: 768, elements: !791)
!797 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "rlimit_max", scope: !645, file: !646, line: 104, baseType: !799, size: 256, offset: 4736)
!799 = !DICompositeType(tag: DW_TAG_array_type, baseType: !797, size: 256, elements: !572)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "ucounts", scope: !404, file: !405, line: 146, baseType: !782, size: 64, offset: 1152)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "group_info", scope: !404, file: !405, line: 147, baseType: !802, size: 64, offset: 1216)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "group_info", file: !405, line: 25, size: 64, elements: !804)
!804 = !{!805, !806, !807}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !803, file: !405, line: 26, baseType: !139, size: 32)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "ngroups", scope: !803, file: !405, line: 27, baseType: !52, size: 32, offset: 32)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !803, file: !405, line: 28, baseType: !808, offset: 64)
!808 = !DICompositeType(tag: DW_TAG_array_type, baseType: !417, elements: !809)
!809 = !{!810}
!810 = !DISubrange(count: -1)
!811 = !DIDerivedType(tag: DW_TAG_member, scope: !404, file: !405, line: 149, baseType: !812, size: 128, offset: 1280)
!812 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !404, file: !405, line: 149, size: 128, elements: !813)
!813 = !{!814, !815}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "non_rcu", scope: !812, file: !405, line: 150, baseType: !52, size: 32)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "rcu", scope: !812, file: !405, line: 151, baseType: !542, size: 128, align: 64)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !818)
!818 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !819)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dentry", file: !821, line: 82, size: 1536, elements: !822)
!821 = !DIFile(filename: "kernel/linux/include/linux/dcache.h", directory: "/home/hiron/Documents", checksumkind: CSK_MD5, checksum: "09d5de2dd48dac98a78cfbca1aaf6670")
!822 = !{!823, !824, !834, !842, !843, !858, !7940, !7942, !7955, !7956, !7957, !7958, !7959, !7964, !7965, !7966}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "d_flags", scope: !820, file: !821, line: 84, baseType: !14, size: 32)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "d_seq", scope: !820, file: !821, line: 85, baseType: !825, size: 32, offset: 32)
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_spinlock_t", file: !826, line: 275, baseType: !827)
!826 = !DIFile(filename: "kernel/linux/include/linux/seqlock.h", directory: "/home/hiron/Documents", checksumkind: CSK_MD5, checksum: "18e7029043c652db6e1b09ede08b05de")
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount_spinlock", file: !826, line: 275, size: 32, elements: !828)
!828 = !{!829}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "seqcount", scope: !827, file: !826, line: 275, baseType: !830, size: 32)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !826, line: 69, baseType: !831)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !826, line: 64, size: 32, elements: !832)
!832 = !{!833}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !831, file: !826, line: 65, baseType: !14, size: 32)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "d_hash", scope: !820, file: !821, line: 86, baseType: !835, size: 128, offset: 64)
!835 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_bl_node", file: !836, line: 38, size: 128, elements: !837)
!836 = !DIFile(filename: "kernel/linux/include/linux/list_bl.h", directory: "/home/hiron/Documents", checksumkind: CSK_MD5, checksum: "35bd436f1f6159eef157d09cf839df5b")
!837 = !{!838, !840}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !835, file: !836, line: 39, baseType: !839, size: 64)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !835, file: !836, line: 39, baseType: !841, size: 64, offset: 64)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "d_parent", scope: !820, file: !821, line: 87, baseType: !819, size: 64, offset: 192)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !820, file: !821, line: 88, baseType: !844, size: 128, offset: 256)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "qstr", file: !821, line: 49, size: 128, elements: !845)
!845 = !{!846, !855}
!846 = !DIDerivedType(tag: DW_TAG_member, scope: !844, file: !821, line: 50, baseType: !847, size: 64)
!847 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !844, file: !821, line: 50, size: 64, elements: !848)
!848 = !{!849, !854}
!849 = !DIDerivedType(tag: DW_TAG_member, scope: !847, file: !821, line: 51, baseType: !850, size: 64)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !847, file: !821, line: 51, size: 64, elements: !851)
!851 = !{!852, !853}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !850, file: !821, line: 52, baseType: !397, size: 32)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !850, file: !821, line: 52, baseType: !397, size: 32, offset: 32)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "hash_len", scope: !847, file: !821, line: 54, baseType: !394, size: 64)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !844, file: !821, line: 56, baseType: !856, size: 64, offset: 64)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !177)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "d_inode", scope: !820, file: !821, line: 89, baseType: !859, size: 64, offset: 384)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode", file: !295, line: 608, size: 5056, elements: !861)
!861 = !{!862, !863, !864, !865, !866, !867, !886, !887, !7860, !7861, !7862, !7863, !7864, !7870, !7871, !7872, !7873, !7874, !7875, !7876, !7877, !7878, !7879, !7880, !7881, !7882, !7883, !7884, !7885, !7886, !7889, !7890, !7891, !7892, !7893, !7894, !7895, !7900, !7901, !7902, !7903, !7904, !7905, !7906, !7911, !7919, !7920, !7921, !7930, !7931, !7932, !7933, !7936, !7939}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "i_mode", scope: !860, file: !295, line: 609, baseType: !114, size: 16)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "i_opflags", scope: !860, file: !295, line: 610, baseType: !116, size: 16, offset: 16)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "i_uid", scope: !860, file: !295, line: 611, baseType: !409, size: 32, offset: 32)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "i_gid", scope: !860, file: !295, line: 612, baseType: !417, size: 32, offset: 64)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !860, file: !295, line: 613, baseType: !14, size: 32, offset: 96)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "i_acl", scope: !860, file: !295, line: 616, baseType: !868, size: 64, offset: 128)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_acl", file: !870, line: 29, size: 256, elements: !871)
!870 = !DIFile(filename: "kernel/linux/include/linux/posix_acl.h", directory: "/home/hiron/Documents", checksumkind: CSK_MD5, checksum: "c39037fcfa4b446249952b719291151f")
!871 = !{!872, !873, !874, !875}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "a_refcount", scope: !869, file: !870, line: 30, baseType: !447, size: 32)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "a_rcu", scope: !869, file: !870, line: 31, baseType: !542, size: 128, align: 64, offset: 64)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "a_count", scope: !869, file: !870, line: 32, baseType: !14, size: 32, offset: 192)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "a_entries", scope: !869, file: !870, line: 33, baseType: !876, offset: 224)
!876 = !DICompositeType(tag: DW_TAG_array_type, baseType: !877, elements: !809)
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_acl_entry", file: !870, line: 20, size: 64, elements: !878)
!878 = !{!879, !880, !881}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "e_tag", scope: !877, file: !870, line: 21, baseType: !513, size: 16)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "e_perm", scope: !877, file: !870, line: 22, baseType: !116, size: 16, offset: 16)
!881 = !DIDerivedType(tag: DW_TAG_member, scope: !877, file: !870, line: 23, baseType: !882, size: 32, offset: 32)
!882 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !877, file: !870, line: 23, size: 32, elements: !883)
!883 = !{!884, !885}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "e_uid", scope: !882, file: !870, line: 24, baseType: !409, size: 32)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "e_gid", scope: !882, file: !870, line: 25, baseType: !417, size: 32)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "i_default_acl", scope: !860, file: !295, line: 617, baseType: !868, size: 64, offset: 192)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "i_op", scope: !860, file: !295, line: 620, baseType: !888, size: 64, offset: 256)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !890)
!890 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode_operations", file: !295, line: 1826, size: 1536, align: 512, elements: !891)
!891 = !{!892, !896, !909, !915, !919, !923, !927, !931, !935, !939, !943, !944, !950, !954, !7790, !7819, !7823, !7829, !7834, !7838, !7842, !7846, !7850, !7856}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "lookup", scope: !890, file: !295, line: 1827, baseType: !893, size: 64)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = !DISubroutineType(types: !895)
!895 = !{!819, !859, !819, !14}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "get_link", scope: !890, file: !295, line: 1828, baseType: !897, size: 64, offset: 64)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = !DISubroutineType(types: !899)
!899 = !{!108, !819, !859, !900}
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "delayed_call", file: !902, line: 10, size: 128, elements: !903)
!902 = !DIFile(filename: "kernel/linux/include/linux/delayed_call.h", directory: "/home/hiron/Documents", checksumkind: CSK_MD5, checksum: "e61eb32de84dec9b8b545d0ea330611b")
!903 = !{!904, !908}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !901, file: !902, line: 11, baseType: !905, size: 64)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!906 = !DISubroutineType(types: !907)
!907 = !{null, !111}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !901, file: !902, line: 12, baseType: !111, size: 64, offset: 64)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "permission", scope: !890, file: !295, line: 1829, baseType: !910, size: 64, offset: 128)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = !DISubroutineType(types: !912)
!912 = !{!52, !913, !859, !52}
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = !DICompositeType(tag: DW_TAG_structure_type, name: "mnt_idmap", file: !432, line: 42, flags: DIFlagFwdDecl)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "get_inode_acl", scope: !890, file: !295, line: 1830, baseType: !916, size: 64, offset: 192)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DISubroutineType(types: !918)
!918 = !{!868, !859, !52, !552}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "readlink", scope: !890, file: !295, line: 1832, baseType: !920, size: 64, offset: 256)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = !DISubroutineType(types: !922)
!922 = !{!52, !819, !393, !52}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !890, file: !295, line: 1834, baseType: !924, size: 64, offset: 320)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = !DISubroutineType(types: !926)
!926 = !{!52, !913, !859, !819, !114, !552}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !890, file: !295, line: 1836, baseType: !928, size: 64, offset: 384)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = !DISubroutineType(types: !930)
!930 = !{!52, !819, !859, !819}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "unlink", scope: !890, file: !295, line: 1837, baseType: !932, size: 64, offset: 448)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DISubroutineType(types: !934)
!934 = !{!52, !859, !819}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "symlink", scope: !890, file: !295, line: 1838, baseType: !936, size: 64, offset: 512)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = !DISubroutineType(types: !938)
!938 = !{!52, !913, !859, !819, !108}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "mkdir", scope: !890, file: !295, line: 1840, baseType: !940, size: 64, offset: 576)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = !DISubroutineType(types: !942)
!942 = !{!52, !913, !859, !819, !114}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "rmdir", scope: !890, file: !295, line: 1842, baseType: !932, size: 64, offset: 640)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "mknod", scope: !890, file: !295, line: 1843, baseType: !945, size: 64, offset: 704)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = !DISubroutineType(types: !947)
!947 = !{!52, !913, !859, !819, !114, !948}
!948 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !115, line: 21, baseType: !949)
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_dev_t", file: !115, line: 18, baseType: !397)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "rename", scope: !890, file: !295, line: 1845, baseType: !951, size: 64, offset: 768)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = !DISubroutineType(types: !953)
!953 = !{!52, !913, !859, !819, !859, !819, !14}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "setattr", scope: !890, file: !295, line: 1847, baseType: !955, size: 64, offset: 832)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = !DISubroutineType(types: !957)
!957 = !{!52, !913, !819, !958}
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iattr", file: !295, line: 226, size: 640, elements: !960)
!960 = !{!961, !962, !963, !973, !982, !983, !988, !989, !990}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "ia_valid", scope: !959, file: !295, line: 227, baseType: !14, size: 32)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "ia_mode", scope: !959, file: !295, line: 228, baseType: !114, size: 16, offset: 32)
!963 = !DIDerivedType(tag: DW_TAG_member, scope: !959, file: !295, line: 241, baseType: !964, size: 32, offset: 64)
!964 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !959, file: !295, line: 241, size: 32, elements: !965)
!965 = !{!966, !967}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "ia_uid", scope: !964, file: !295, line: 242, baseType: !409, size: 32)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "ia_vfsuid", scope: !964, file: !295, line: 243, baseType: !968, size: 32)
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "vfsuid_t", file: !969, line: 16, baseType: !970)
!969 = !DIFile(filename: "kernel/linux/include/linux/mnt_idmapping.h", directory: "/home/hiron/Documents", checksumkind: CSK_MD5, checksum: "41af6e4101191153091207971e03c703")
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !969, line: 14, size: 32, elements: !971)
!971 = !{!972}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !970, file: !969, line: 15, baseType: !414, size: 32)
!973 = !DIDerivedType(tag: DW_TAG_member, scope: !959, file: !295, line: 245, baseType: !974, size: 32, offset: 96)
!974 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !959, file: !295, line: 245, size: 32, elements: !975)
!975 = !{!976, !977}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "ia_gid", scope: !974, file: !295, line: 246, baseType: !417, size: 32)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "ia_vfsgid", scope: !974, file: !295, line: 247, baseType: !978, size: 32)
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "vfsgid_t", file: !969, line: 20, baseType: !979)
!979 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !969, line: 18, size: 32, elements: !980)
!980 = !{!981}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !979, file: !969, line: 19, baseType: !421, size: 32)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "ia_size", scope: !959, file: !295, line: 249, baseType: !131, size: 64, offset: 128)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "ia_atime", scope: !959, file: !295, line: 250, baseType: !984, size: 128, offset: 192)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec64", file: !502, line: 13, size: 128, elements: !985)
!985 = !{!986, !987}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !984, file: !502, line: 14, baseType: !501, size: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !984, file: !502, line: 15, baseType: !797, size: 64, offset: 64)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "ia_mtime", scope: !959, file: !295, line: 251, baseType: !984, size: 128, offset: 320)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "ia_ctime", scope: !959, file: !295, line: 252, baseType: !984, size: 128, offset: 448)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "ia_file", scope: !959, file: !295, line: 259, baseType: !991, size: 64, offset: 576)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64)
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !295, line: 961, size: 1856, align: 64, elements: !993)
!993 = !{!994, !1005, !1006, !1008, !1009, !1017, !1018, !1019, !7561, !7562, !7563, !7564, !7565, !7783, !7784, !7785, !7786, !7787, !7788, !7789}
!994 = !DIDerivedType(tag: DW_TAG_member, scope: !992, file: !295, line: 962, baseType: !995, size: 128)
!995 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !992, file: !295, line: 962, size: 128, elements: !996)
!996 = !{!997, !1003, !1004}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "f_llist", scope: !995, file: !295, line: 963, baseType: !998, size: 64)
!998 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "llist_node", file: !999, line: 60, size: 64, elements: !1000)
!999 = !DIFile(filename: "kernel/linux/include/linux/llist.h", directory: "/home/hiron/Documents", checksumkind: CSK_MD5, checksum: "df24efabc3e6763dee25a8dee74e3a37")
!1000 = !{!1001}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !998, file: !999, line: 61, baseType: !1002, size: 64)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "f_rcuhead", scope: !995, file: !295, line: 964, baseType: !542, size: 128, align: 64)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "f_iocb_flags", scope: !995, file: !295, line: 965, baseType: !14, size: 32)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "f_lock", scope: !992, file: !295, line: 972, baseType: !149, size: 32, offset: 128)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "f_mode", scope: !992, file: !295, line: 973, baseType: !1007, size: 32, offset: 160)
!1007 = !DIDerivedType(tag: DW_TAG_typedef, name: "fmode_t", file: !115, line: 156, baseType: !14)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "f_count", scope: !992, file: !295, line: 974, baseType: !476, size: 64, offset: 192)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "f_pos_lock", scope: !992, file: !295, line: 975, baseType: !1010, size: 256, offset: 256)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !1011, line: 64, size: 256, elements: !1012)
!1011 = !DIFile(filename: "kernel/linux/include/linux/mutex.h", directory: "/home/hiron/Documents", checksumkind: CSK_MD5, checksum: "07dbf2af2b9fefa5fbfe27d0e0b15981")
!1012 = !{!1013, !1014, !1015, !1016}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !1010, file: !1011, line: 65, baseType: !476, size: 64)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !1010, file: !1011, line: 66, baseType: !491, size: 32, offset: 64)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "osq", scope: !1010, file: !1011, line: 68, baseType: !486, size: 32, offset: 96)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !1010, file: !1011, line: 70, baseType: !187, size: 128, offset: 128)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "f_pos", scope: !992, file: !295, line: 976, baseType: !131, size: 64, offset: 512)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "f_flags", scope: !992, file: !295, line: 977, baseType: !14, size: 32, offset: 576)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "f_owner", scope: !992, file: !295, line: 978, baseType: !1020, size: 256, offset: 640)
!1020 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fown_struct", file: !295, line: 915, size: 256, elements: !1021)
!1021 = !{!1022, !1045, !7557, !7558, !7559, !7560}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !1020, file: !295, line: 916, baseType: !1023, size: 64)
!1023 = !DIDerivedType(tag: DW_TAG_typedef, name: "rwlock_t", file: !1024, line: 34, baseType: !1025)
!1024 = !DIFile(filename: "kernel/linux/include/linux/rwlock_types.h", directory: "/home/hiron/Documents", checksumkind: CSK_MD5, checksum: "dff80c89ec6551b7d56ae9ff5387a240")
!1025 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1024, line: 25, size: 64, elements: !1026)
!1026 = !{!1027}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !1025, file: !1024, line: 26, baseType: !1028, size: 64)
!1028 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_rwlock_t", file: !1029, line: 27, baseType: !1030)
!1029 = !DIFile(filename: "kernel/linux/include/asm-generic/qrwlock_types.h", directory: "/home/hiron/Documents", checksumkind: CSK_MD5, checksum: "724e2bc1afabb3b7b6860c9799b9cd27")
!1030 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "qrwlock", file: !1029, line: 13, size: 64, elements: !1031)
!1031 = !{!1032, !1044}
!1032 = !DIDerivedType(tag: DW_TAG_member, scope: !1030, file: !1029, line: 14, baseType: !1033, size: 32)
!1033 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1030, file: !1029, line: 14, size: 32, elements: !1034)
!1034 = !{!1035, !1036}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "cnts", scope: !1033, file: !1029, line: 15, baseType: !139, size: 32)
!1036 = !DIDerivedType(tag: DW_TAG_member, scope: !1033, file: !1029, line: 16, baseType: !1037, size: 32)
!1037 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1033, file: !1029, line: 16, size: 32, elements: !1038)
!1038 = !{!1039, !1040}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "wlocked", scope: !1037, file: !1029, line: 18, baseType: !173, size: 8)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "__lstate", scope: !1037, file: !1029, line: 19, baseType: !1041, size: 24, offset: 8)
!1041 = !DICompositeType(tag: DW_TAG_array_type, baseType: !173, size: 24, elements: !1042)
!1042 = !{!1043}
!1043 = !DISubrange(count: 3)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !1030, file: !1029, line: 26, baseType: !161, size: 32, offset: 32)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !1020, file: !295, line: 917, baseType: !1046, size: 64, offset: 64)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64)
!1047 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pid", file: !259, line: 59, size: 768, elements: !1048)
!1048 = !{!1049, !1050, !1051, !1052, !1054, !1055, !1056, !1057}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1047, file: !259, line: 61, baseType: !447, size: 32)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1047, file: !259, line: 62, baseType: !14, size: 32, offset: 32)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !1047, file: !259, line: 63, baseType: !149, size: 32, offset: 64)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !1047, file: !259, line: 65, baseType: !1053, size: 256, offset: 128)
!1053 = !DICompositeType(tag: DW_TAG_array_type, baseType: !773, size: 256, elements: !572)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "inodes", scope: !1047, file: !259, line: 66, baseType: !773, size: 64, offset: 384)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "wait_pidfd", scope: !1047, file: !259, line: 68, baseType: !144, size: 192, offset: 448)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "rcu", scope: !1047, file: !259, line: 69, baseType: !542, size: 128, align: 64, offset: 640)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "numbers", scope: !1047, file: !259, line: 70, baseType: !1058, offset: 768)
!1058 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1059, elements: !809)
!1059 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "upid", file: !259, line: 54, size: 128, elements: !1060)
!1060 = !{!1061, !1062}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !1059, file: !259, line: 55, baseType: !52, size: 32)
